{"date": [], "post": [], "description": [], "title": []}
{"date": ["14 Ağustos 2012 "], "post": [" Python,Pyqt Ve Qt İle Gui Dünyası", "\r\n\tRamazan dolayısıyla bloguma çok fazla yazı giremediğimin farkındayım.Bi tam başlarda başladığım Arduino tutkusu ile birlikte yazdığım yazılar var.Arduino tutkum tabikide geçmedi hatta daha da arttı diyebilirim.Ancak aklımda olan Arduino ile kullanabileceğim gui programlamarın nasıl yapılacağıydı.Python bana tamamen yeten bir dil olduğu için direk onunla başladım yola.Önceden beri gördüğüm ama beni hiç içine çekmeyen Gtk,PyQt,Tkinter hepsine baktım.Örnekleri bir bir inceledim,karşılaştırmaları okudum.Ve sonunda kesinlikle doğru karar verdiğime inandığım Qt macerasına başladım.Python ile yazdığım kodlara artık güzel bir grafik arayüzü oluşturabiliyorum.", "\r\n\t", "\r\n\tOluşturuğum Gui'lere Python ile seri porttan Arduino ile haberleşmesini sağlayabiliyorum.Hatta Django kullanarak bu verileri web arayüzlü olarakta yayınlayabiliyorum.Kısacası tam anlamıyor bir Python 3lüsü kurdum.Web,Gui,Konsol.Hepsinde Python'un parmağı var.", "\r\n\tAslında Python için gui arayışlarımın bütün sebebi Arduino değildi.Çünkü gerçekten bir zaman sonra sadece konsol uygulamaları yetmiyor.Biraz da göze hitap eden programlamar yazmak gerekiyor.Sonuçta şu anda bu satırları yazdığım webbrowser olan Firefox'ta bir grafik arayüzüne sahip.Kullandığım masaüstü ortamı Gnome'da bir grafik arayüzüne sahip.Bu yüzden benimde bir yerden başlamam gerekiyordu.Aralarında yaptığım incelemelerde PyQt'ye karar kıldım.Ve bundan çok memnunum.Şu anda ufak çaplı uygulamalar yapıp kullanma alışkanlıklarımı arttırıyorum.", "\r\n\tYıllar önce Delphi,Visual Basic hatta Yunus adında(tam bir dil olmasada programlama motoru ve çok eski) birçok gui tasarımına yarayan araçla,programlama diliyle uğraşan biri olarak Qt Designer'ın arayüzü beni korkutmadı.Hatta bir hayli hoşuma gitti.Hemen C#'ın .Net'i ile kafam kıyaslama yaptım.Ve farkettiğim kadarıyla eksiği yok fazlası var :D", "\r\n\tİşte yaptığım ilk programın gui tasarımı.", "\r\n\t", "\r\n\tGui tasarımı yapmak bir hayli kolay ve hoş.Özellikle sinyal olayına baya bi hasta oldum.Sinyal moduna bastıktan özellik atamak istediğinizi seçip uzatıyorsunuz.Ve istediğiniz yerde bırakıp özellik seçiyorsunuz.", "\r\n\tYukarıdaki gibi gui tasarımını yaptıktan sonra pyuic4 kullanarak bu ui tasarımını python diline çeviriyoruz.Bunun için vermemiz gereken komut.", "\r\n\tŞimdi ise bu arayüze istediğimiz python kodunu entegre ediyoruz.Ve işin eğlenceli kısmı burada bitiyor.Artık bundan sonra sizin hayal gücünüz ve yetenekleriniz başlıyor.Aşağıda benim sadece işimi görmesi için yazdığım bir kod parçacığı var.Sadece komutların nasıl entegre edildiğini anlamanız için yararlı olacaktır.", "\r\n\tBu ve birkaç tane daha çalışan PyQt çalışmasını koyduğum ", " depoma bakabilirsiniz.Widgetlerin nasıl kullanıldıklarını anlamak için faydalı olabilir.", "\r\n\tİşte bu kadar güzel bir dil ve bu kadar güzel bir gui için maalesef Türkçe kaynak kıtlığı var.Nette gördüğüm en sağlam python kaynağı istihza'da bile PyQt yerine Gtk ve Tkinter'a ağırlık verilmiş.Eğer siz PyQt ile ilgileniyorsanız kesinlikle bakmanız gereken 2 site var.Bunlar ", "(Giriş yaptıktan sonra sağ taraftan dersleri değiştirebilirsiniz) ve ", "(Aynı şekilde alt kısımdan değiştirebilirsiniz).", "\r\n\tBu iki site dışında ise genelde hep ufak çaplı konulara değinilmiş.Bazı forumlarda başlangıçlar yapılmış ama devamları gelmemiş.Eğer ciddi olarak ilgileniyorsanız yardım alabileceğiniz yerlerin başına orjinal sitesindeki ", " sayfası.Ben bura ile irc.freenode.net #pyqt kanalından faydalanıyorum.Özellikle irc'ta sorduğunuz sorulara çok kısa sürede cevap geliyor.", "\r\n\tQt ile söylemek istediğim bir güzel nokta da C++ ile de kullanılıyor olması.Hatta o dil ile yazılıp Python'dan daha fazla onunla kullanılıyor.Benimde bildiğim ama çok uzun süredir uğraşmadığım C++ ile yaklaşık 1 sene sonra okulda uğraşmaya başlayacağım için C++ için gui olarak Qt kullanmayı düşünüyorum.Hem Qt hemde C++ güzelce pekişir."], "description": [" Python,Pyqt Ve Qt İle Gui Dünyası"], "title": ["Qt Ve Python Maceralarım"]}
{"date": ["29 Ağustos 2012 "], "post": [" Arduino Uno İle Ethernet Bağlantısı", "\r\n\tArduino hobi elektronik olarak gerçekten insana çok şey katıp ufkunu açıyor.Aklınıza gelecek neredeyse her türlü projenizi kısa süre yapmanızı sağlıyor.Benimde bu yaz tatilinde ciddi derece de ilgilendiğim Arduino ile bu sefer de internete bağlanma gereksinimi hissettim.Bunun için Arduino'nun ethernet modeli ile Arduino Ethernet Shield bulunuyor.Ben bunların yerine ebaydan 4-5 dolara alabileceğiniz ENC28J60 modülünü kullanarak Arduino'mu internete bağladım.", "\r\n\t", "\r\n\tTabi internete bağladım derken aklınıza sadece internete girmek gelmesin.Bu modül ile kablosunu taktığınız ağa dahil oluyorsunuz.Daha sonra bu ağda yapmak istediğiniz aklınıza gelen herşeyi yaptırabiliyorsunuz.Örneğin bu ağda bir webserver kurarak ağa bağlı diğer kişilerin girmesini sağlayabilirsiniz.Veya arduino'nun digitall ve analog girişlerinden gelen değerleri internetteki herhangibi bir yere gönderip depolayabilirsiniz.Hatta Arduino bağlı ağa internetten erişip röle kontrolü veya aklınıza gelecek akıllı ev modellerinden birisini gerçekleştirebilirsiniz.(Örneğin uzun tatillere gittiğinizde istediğiniz zaman camlarınızı açıp havalandırabilir, bitkilerinizin suyunu dökebilir veya hayvanınızın yemini verebilirsiniz.)", "\r\n\tArduino'yu ağa bağladıktan sonra internet ve yerel ağ ile ilgili aklınıza gelebilecek herşeyi gerçekleştirebilirsiniz.Bundan sonrası sizin hayal gücünüz ve yeteneklerinize kalmış.", "\r\n\tBen ENC28J60 modülümü ebaydaki ", " ilandan aldım.Yaklaşık 15 gün içinde elime ulaştı.Satıcı gayet güvenilir birisi.Satışın hemen ardından bana tracking number ve takip edeceğim yeri verdi.Bu sayede modülümün nerede olduğunu sürekli olarak kontrol ettim.", "\r\n\tSizinde bir şekilde elinize bu modül geçerse aşağıdaki şekilde bağlantılarınızı kurabilirsiniz.(Türkiyede 40-50 lira civarında satılıyor)", "\r\n\t", "\r\n\tVoltaj bağlantısını yaparken dikkat etmeniz gereken nokta her zamanki gibi Arduino'nuzun 5v çıkışı yerine 3.3v çıkışına bağlamanız gerekli.Bu bağlantıyı yaptıktan sonra diğer bağlantılar aşağıdaki gibi olacak.", "\r\n\t", " ", " --&gt; ", "\r\n\t", " ", " --&gt; ", "\r\n\t", " ", " --&gt; ", "\r\n\t", " ", " --&gt; ", "\r\n\tBu bağlantıları doğru şekilde kurduktan sonra donanımsal olarak yapacaklarımız bitti.Bundan sonra Arduino'nun yazılımını yüklememiz lazım.Bunun için arduino'nun orjinal ethernet kütüphanesini de kullanabilirsiniz.Ancak o zaman bağlantılarda bir değişiklik yapıp CS bağlantısını 8 yerine 10'a yapmanız gerekir.", "\r\n\tBen yazılım olarak ", " kullandım.Örnekleri ve kullanım olarak gayet hoşuma gitti.Sizde indirip Arduino'nun kütüphaneler dizinine atarak kullanabilirsiniz.", "\r\n\tİlk denemem de odamdaki sıcaklık değerlerini cosm'a yükledim.Gayette hoş oldu diyebilirim.Kısa süreliğine yaptığım o testin grafikleri için ", " bakabilirsiniz.İşte o test sırasında çektiğim bir resim.", "\r\n\t", "\r\n\tAnalog 0 girişine gelen sıcaklık değerlerini ethercard örnekleri içinde de yer alan cosm apisine yükledim.Bunu 2 dakikada bir yaptığımda en uygun sonuçları aldım.Saniyede bir yaptığımda ise bir süreden sonra bağlantının koptuğunu fark ettim.Belki benim netimden kaynaklıdır.", "\r\n\tSonuç olarak Arduino için hem ucuz hem de pahalı tercihler var.Siz ihtiyaçlarınız doğrultusunda tercih yapmalısınız.Yukarıdaki gördüğünüz ENC28J60 diye google'da aratıp Türkçe sayfalar derseniz ne demek istediğimi anlarsınız.Tabi bu aldıkları fazla paraların sebebi ise 1 gün sonra elimize ulaşması.Benim zamanım yok param var diyorsanız Türkiye,param yok zamanım var diyorsanız Ebay sizin için doğru tercih olacaktır."], "description": [" Arduino Uno İle Ethernet Bağlantısı"], "title": ["Enc28j60 Ve Arduino"]}
{"date": ["21 Ağustos 2012 "], "post": [" Hızlı Proxy Olarak Facebook'u Kullanma", "\r\n\tGeçenlerde Facebook'un siteler için kullandığı og tagı ile araştırma yaparken ilginç bir durumla karşılaştım.Facebook bu kodlar için ufak bir debugger yapmış.Bu araç ile og taglarını analiz edebiliyorsunuz.Buraya kadar herşey normal.Ancak bu debugger'ın bir özelliği olan sayfayı tarama özelliği maniple edilebilecek cinsten.Buna göre yazdığınız sitenin kaynak kodlarını Facebook sizin yerinize çekip ekranınıza basıyor.Böylelikle bu araç ufak amaçlar için proxy olarak kullanılabilir.Bunu düşündükten hemen sonra internete bu konu ile daha önce çalışma yapılmış mı diye baktığımda sadece birkaç yerde bu konudan bahsedilmiş.Hatta ufak bir scrapper örneğide yazılmış.", "\r\n\t", "\r\n\tKullanılan araç ", ".Siteye girip anonim olarak bakmak istediğiniz siteyi yazın.Daha sonra Debug butonuna basın.Gelen sayfanın en altına yer alan Scraped Url linkine bastığınızda o sayfanın kaynak kodlarını ekranda göreceksiniz.", "\r\n\tYani bu aracı aşağıdaki linkteki www.halitalptekin.com yerine kullanmak istediğiniz sitenin adresini yazarak kullanabilirsiniz.", "\r\n\t- Bu araç ile GET istekleri gönderip sayfaların HTML kodlarına bakabiliriz(Güvenliği olmadığını düşündüğünüz sitenin kaynak koduna bakıp daha sonra girebilirsiniz)", "\r\n\t- Ufak kodlar yazarak istediğimiz sitenin dizin ve dosyalarını listeleyebiliriz.(File and Directory Crawling)", "\r\n\t- Ama bu araç ile POST istekleri gönderemeyip, çerezler üzerinde değişiklik yapamayız.Bir de bu aracı kullanmak için giriş yapmak zorundayız.", "\r\n\tBu aracı direk olarak kodlarımıza ekleyerek kullanmanın yanında webserver(Tornado,Django vb) kurarak buradan çektiğimiz kodları tekrardan render edip sayfaya basabiliriz.Böylelikle gerçek bir proxy elde etmiş oluruz.Ben urllib2 kullanarak sayfadan veriyi çekip(cookie göndermeden olmaz) bunu parse ettim ve gereksiz kodlardan temizledim.Daha sonra da tornado web server kullanarak tekrardan render edip ekrana bastım.Şu anlık gayet güzel çalışıyor.Belki ileride bunun da paylaşımını yapabilirim."], "description": [" Hızlı Proxy Olarak Facebook'u Kullanma"], "title": ["Facebook'u Proxy Olarak Kullanma"]}
{"date": ["09 Eylül 2012 "], "post": [" Python'a Başlamak İsteyenler İçin Yol Haritası", "\r\n\tPython ile ilgili çok fazla soru gelen kısımlardan birisi Python'a nasıl başlamalıyım nasıl ilerlemeliyim şeklinde oluyor.Ben de bu soruna kendimin izlediği yolu anlatarak çözüm bulmaya çalışacağım.Öncelikle kendinize Python'u öğreneceğinizi şartlamanız gerekiyor.Çünkü hiçbirşey zorla yapılmaz.Eğer başlarda en ufak bir heyecan alamıyorsanız bırakın devam etmeyin.Python diğer dillerden aksine zevk alındığı ve kullanana heyecan verdiği için bu kadar populer bir dil.", "\r\n\t", "\r\n\t", "\r\n\tEtrafta bu kadar çok güzel ve eski bir dil varken neden gidip Python'u seçmeliyim diyebilirsiniz.Python'un diğer dillerden çok bir fazlası yoktur.Ancak fazlası olan konularda ise ayrıcalığını koymuştur.Bunların en başında temiz ve kolay syntax yapısı gelir.Bana göre Python'dan daha kolay öğrenebilen bir dil şu anlık yok.Bunun yanında eskiden yazılmış olan kodları okumakta diğer dillere göre çok çok kolaydır.Benim Python'u seçmemdeki en güzel etken bu olmuştu.Ancak sadece kolay bir dil olması ve temiz bir syntaxa sahip olması bir dili diğer dillerden üstün yapmaz.Python'un çok çok iyi olduğu farklı konularda vardır.Ve diğer dillere göre çok farklı alanlarda kullanılırlar.Uzaya gönderilcek robotun testlerini yapmaktan, Mozilla'nın sitesine, network izleme programı yapmaktan, mikroişlemci programlamaya kadar.Bu yüzden ben bu başlık altında sadece kolaylığına dikkat çekmek istedim.", "\r\n\tAşağıdaki bir java ve python kodu var.İki kod da ekrana hello world yazıyor.Yorumunu size bırakıyorum.(İlki java diğeri python)", "\r\n\t", "\r\n\tÖncelikle etraftan duyduğunuz Türkçe kaynak hiç yok lafını bir kenara atın.Çünkü biz ", " gibi harika bir siteye sahibiz.Hemen buraya giriyoruz ve konularda sırayla ilerliyoruz.Konu sonunda yer alan güzel sorulara kendimiz cevap vermeye çalışıyoruz.Bunları yaparken de aklımızda Python konuları bitince yapacağımız güzel bir proje düşünüyoruz.Bu projede tüm öğrendiğiniz yetenekleri sergileyeceksiniz.", "\r\n\tİstihza'da konularda sırayla ilerlerken takıldığınız yeri direk olarak google'a soruyoruz.Gizli saklı köşelerde kalmış çok güzel Türkçe Python kaynakları var.Dikkat ettiyseniz Türkçe dedim.İlk tercihiniz her zaman Türkçe olsun.Böylelikle hem bu kaynakları üst sıralara çıkartırız hem de kendi dilimizden çok daha iyi öğreniriz.", "\r\n\tİstihza'da ilerlerken bazı konularda sadece okumak anlamanız için yeterli gelmeyecektir.Bu yüzden Google'a ", " yazıp videolu kaynak arıyoruz.Veya bunu yapmazsanız youtube'a girip gene aynı şekilde ", " yazıyoruz ve sırayla izlemeye başlıyoruz.", "\r\n\tBelirli bir eşik değerini aştığınızı düşündüğünüzde ise yabancı kaynaklara başlıyoruz.Bu konuda benim çok beğendiğim ", " playlist var.Bu videolar hem güzel bir tekrar hem de başka python kullanıcılarından güzel Python trickleri öğrenmenizi sağlayacaktır.", "\r\n\tArtık bu videolarıda bitirdiğinize göre ciddi derece ingilizce kaynaklara bakabilirsiniz.", ", ", ", ", " gibi anahtar aramalar ile güzel kod parçacıkları bulup bunları inceleyebilirsiniz.Bu kod parçacıkları sizin ufkunuzu açacak ve ilerde yapacağınız projelerde kullanacağınız teknikleri de geliştirecektir.", "\r\n\tBu dediklerimi yaptığınızda en azından artık beginner'in üstü intermediate'in altı bir Python bilginiz olacak.Tabi bu sizin istek ve yeteneğinize göre değişebilir.Bu öğrendiklerinizi de güncel olarak karşılaştığınız problemleri çözmekte kullanabilirsiniz.Örneğin bir ", " programı veya ", " programı yapabilirsiniz.", "\r\n\t", "\r\n\tArtık yazılı kaynaklara başvurma zamanınız gelmiştir.Benim daha önceden okuduğum ve çok hoşuma giden ", " , ", " ve ", " kitaplarından birisini almanız sizin için yeterli olacaktır.Bu kitaplardan gerçekten de işinde uzman olan Python programcılarının kullandığı metodları,kod yazma sanatını ve inceliklerini öğrenebilirsiniz.", "\r\n\tBu kitaplara alternatif olarak ücretsiz olan ", " kitabı var.Bu kitapta da normalde pek bulamayacağınız advance seviye konulara değiniliyor.Telefonunuza e-book olarak atmakta fayda var.", "\r\n\tVe artık ciddi derecede bir Python bilginiz olduğunu düşünüyorsanız Python'un gizli yanlarını keşfedebilirsiniz.Bunun için internette çok fazla kaynak var.Ben genelde ", "'dakine ara ara göz atarım.Sizde yapın faydasını göreceksiniz.", "\r\n\t", "\r\n\tBu konuda benim sizlere önerim kesinlikle ", " olacaktır.1 aylık deneme sürümünü kullanıpta beğenirseniz ücretini vererek kullanmaya başlayabilirsiniz.Veya o 1 ay içinde açık kaynak bir projeye başlayıp veya katılırsanız PyCharm sizlere ücretsiz lisans veriyor.", "\r\n\tPyCharm'in yanında hafif olarak kullanabileceğiniz ", " bence harika bir kod editörü.Python için özelleştirip kendinize tam bir IDE haline de getirebilirsiniz.", "\r\n\tBu iki editör GUI ekranında size yardımcı olacaktır.Ancak uzaktan bağlandığınız bir serverdaki Python dosyasını bununla düzenleyemezsiniz.Bu yüzden bir tane de konsol kod editörü bilmeniz gerekecektir.Benim %100 olarak önerdiğim editör ", " dir.Python için harika ayarlar ile PyCharm ve Sublime Text 2'ye bile gerek kalmadan başlı başına bir IDE haline gelebilir.(Kendi ", " klasörüme bakabilirsiniz.Python için geliştirilmiştir.)", "\r\n\t", "\r\n\tTabikide hayır.Python ", ",", " ve ", " ile sizlerin GUI uygulaması yapabilmenize olanak sağlıyor.Hatta sürekli olarak da yeni GUI ortamları geliştiriliyor.Benim size tavsiyem kesinlikle ", " olacaktır.Qt ile tasarımı çizip PyQt kullanarak bunları koda dökmeniz gayet basittir.Ayrıcana da bir hayli gelişmiştir.Ben kesinlikle ", "'yi öneriyorum.", "\r\n\tFark ettiyseniz üstteki platformların hepsinde link verdim ve sizi istihza'ya yönlendirdim.İstihza sizin başucu kaynağınız olmalı.Qt dışında tüm kaynakları göz dolduruyor.Ancak Qt'de biraz eksiklikler var.Sizde bu eksiklikleri ", " den doldurabilirsiniz.Veya yukarı kısımlarda yaptığımız mantığı uygulayarak ", ", ", ", ", " anahtar kelimeleri ile kendinize kaynak yaratabilirsiniz.", "\r\n\t", "\r\n\tPython web programlama konusunda da bir hayli gelişmiş durumda.İçinde bir hayli fazla framework bulunduruyor.Bunlardan ilk aklıma gelenleri ", ", ", ", ", ", ", ", ", ", ", " ve ", " .Diyeceksiniz ki bu kadar çok framework var hangisini seçelim.Bana sorarsanız ", " ile başlarsanız diğerlerine geçmeye fırsat bulamazsınız.Hem Türkçe kaynak olarak da diğerlerinden kat kat üstün durumda.", "\r\n\tPython ile geliştirilmiş olan web server ", "'ya da kesinlikle bakın derim.İlerde ufak çaplı işlerinizde kullanabilirsiniz.(Arduino ve web bağlantısında kullanılabilir.)", "\r\n\t", "\r\n\tEğer telefonunuz Symbian ise Python ile yapılmış birçok uygulamayı daha önce kullanmışınızdır.Bu yüzden siz de yapabilirsiniz.Ancak cep telefonunuz android veya iphone ise şimdilik biraz sıkıntıları var.SL4aA kullanarak android mobil uygulama geliştirebiliyorsunuz ancak ben henüz geliştirmediğim için kesin bir şey diyemeyeceğim.Ama şunu diyebilirim Python cross-platform olduğu için aklınıza gelecek her işletim sisteminde çalışır ve ona uygun kod yazabilirsiniz.", "\r\n\t", "\r\n\tYukarıdakileri yaptığınıza göre artık ciddi bir bilgi birikiminiz olmalı.Ve bu bilgilerinizi bir projede kullanmalısınız.Bu sayede bilgileriniz de pekişir.", "\r\n\tMesela Django sitenize PyQt kullanarak bilgisayarınızdan post girme programı yapabilirsiniz.Bunun için öncelikle Django sitenizi tamamlamış olmanız gerekiyor.Daha sonra API için bir uygulama yazmanız veya hazır olanı kullanmanız lazım.Bunun için ", " kullanabilirsiniz.Daha sonra Qt tasarımını çizin ve PyQt kodlamasını kullanın.Bu aşamada karşılaşacağınız bir sorun olarak GUI'nin kitlenmesi olabilir.Bunu da ", " kullanarak aşabilirsiniz.Python kodunuzun API'ye bağlanması sırasında urllib veya urllib2 kullanmak size kalmış.", "\r\n\tBunun yanında bir başka güzel proje de kendi okulunuzdaki değişmeleri anlık olarak size bildiren bir program olabilir.Bunu yapmak için öncelikle okulunuzun sitesine mechanize,urllib,urllib2 kullanarak bağlanmanız lazım.Daha sonra da kaynaktaki linkleri BeatifulSoup kullanarak toplamalısınız.Bütün bu linkleri bir txt dosyasında saklarsanız çok daha iyi olur.Hem yeni bir link eklendiğinden de haberdar olabilirsiniz.Daha sonra bu linklere teker teker bağlanıp kaynak kodununun md5 değerini aynı txt dosyasına url:md5 şeklinde saklamalısınız.Bu sayede program her çalıştığında linklere girip md5 değerlerinin değişip değişmediğini öğrenebilirsiniz.Tebrikler artık okulunuzun sitesindeki en ufak değişikliklerden haberiniz oluyor :D", "\r\n\t", "\r\n\tBence asıl olay burada başlıyor.Çünkü bu aşamadan sonra kendinizi iyice geliştirmeniz gerekecek.Bunun için sosyal medyayı kullanmanız lazım.Twitter'dan ünlü Python programcılarını takip edebilir, takıldığınız soruları mail ile sorabilirsiniz.", "\r\n\tBunların yanında reddit'teki ", " ve ", " kanalında sorularınızı sorabilir, yeni teknolojileri takip edebilirsiniz.", "\r\n\tTüm programcıların girdiği ", " sitesindeki linkleri takip edip Python ile ilgili olanlarına göz atabilirsiniz.Veya ", " adındaki hn benzeri sadece Python kaynaklarını içeren siteyede girebilirsiniz.", "\r\n\tStumbleupon'da Python kanalına girip sürekli olarak yeni siteleri stumble yapabilirsiniz.Bu sayede hem güncel hem de çok populer olan yazılara ve kaynaklara ulaşabilirsiniz.", "\r\n\tTürkçe", "şu anda pek aktif olmasa da Python ile yapılmış tüm ", " bakabilirsiniz.", "\r\n\tKendinize Python programcılarının bloglarının bir listesini oluşturun ve bu blogların RSS'lerini Rss Readerlar ile okuyunuz.Mesela ", ",", ",", ", ", " vb", "\r\n\tGithub'a girip Python ile yazılmış kodları inceleyebilirsiniz.Kendinizde bir depo oluşturup tüm Python kodlarınızı buraya atabilirsiniz.", "\r\n\tSürekli olarak gireceğiniz Python sitelerini tespit edin.Mesela benim hep girdiğim ", " veya ", "(daha aktif değil) sitesi güzel bir örnek.Forumlarada göz atabilirsiniz.Özellikle Türkçe Ubuntu ve Pardus forumları Python olarak baya zenginler."], "description": [" Python'a Başlamak İsteyenler İçin Yol Haritası"], "title": ["Python Yol Haritası"]}
{"date": ["03 Eylül 2012 "], "post": [" Couchdb Uygulamalarınız İçin Ücretsiz Bir Alternatif", "\r\n\tBir önceki yazımda Python ve Django ile CouchDB'yi nasıl kullanacağımızı ana hatlarıyla anlatmıştım.Ancak her zaman olduğu gibi bu tür yazılarda hep localhost'ta denemeler yaparız.İşte bu yüzde her zaman evdeki hesap çarşıya uymaz.Localde yaptıklarınızın kendi serverınızda nasıl çalışacağı hakkında bilgi edinmeniz ve deploy'a hazırlanmanız gerekir.Burada da gidip couchdb destekli bir hosting almanıza gerek yok.En azından alıştırma yapmak ve ufak amaçlı işlerinizde kullanmak için ücretsiz alternatiflere yönelmelisiniz.Bu alternatiflerin başında da iriscouch geliyor.", "\r\n\tİriscouch'a kayıt olmak ve kullanmak tahmin edeceğinizden de kolay.Öncelikle ", " giriş yapıyoruz ve sağ taraftaki kısımı dolduruyoruz.", "\r\n\t", "\r\n\tDaha sonra Send butonuna basıp kaydımızı tamamlıyoruz.Bundan sonra önümüze bir adet link gelmesi lazım.Bu link bizim admin panelimiz.", "\r\n\t", "\r\n\tBu linke girdiğinizde aşağıdaki gibi bir kullanıcı dostu ekran sizi karşılayacak.", "\r\n\t", "\r\n\tEvet ücretsiz DB'miz hazır.Şimdi de python'a geçip veritabanımıza bağlanalım ve tablolarımızı oluşturup içlerine veri koyalım.", "\r\n\t", "\r\n\tBir önceki ", " yazımda kullandığım kodların aynısını kullandım.Ayrıntılı bilgiyi o yazımdan öğrenebilirsiniz.Ve şimdide admin panelimizden bu eklediğimiz verilere bakalım.", "\r\n\t", "\r\n\tNe kadar da güzel duruyor değil mi ? Biraz daha içeri girelim.", "\r\n\t", "\r\n\tTum verileri bu şekilde de çekebilirsiniz.", "\r\n\t", "\r\n\tHerşey buraya kadar güzel.Ancak bu oluşturduğumuz veritabanı Public oldu.Yani herkes tarafından erişilebilir ve değiştirilebilir.Bunu önlemek için admin eklememiz gerekiyor.Bunuda girdiğimiz bu paneldeki sağ alt köşede yazan \"Everyone is admin.Fix This\" yazısındaki linke basarak düzeltebiliriz.Bu sayede artık bir adminimiz var ve erişimleri o ayarlayacak.", "\r\n\t", "\r\n\tŞimdi Python'dan ekleme çıkarma gibi işlemleri deneyelim.", "\r\n\t", "\r\n\tSizin yetkiniz yok siz admin değilsiniz cevabını aldığımıza göre artık korumamız altında.", "\r\n\tİrisCouch gerçekten çok güzel bir ücretsiz alternatif.Çünkü piyasada CouchDB alıştırması yapacağınız servis bulmak çok zor.Olanlar da çok pahalı.Bu noktada iriscouch'un ücretlendirme politikasının da çok iyi  olduğunu söyleyebilirim.Buna göre yaptığınız her işlemin bir ücreti var.Ancak bu işlemlerin ücreti 5 doların altında ise herhangibi bir ücret ödemiyorsunuz.Buda ufak geliştiriciler için bir hayli yeterli bir kaynak anlamına geliyor.", "\r\n\tGB başına 1 dolardan depolama, her 100 PUT, POST, DELETE gibi yazma işlemi için 1 ¢(517 istek 0.05$ yapıyor), her 500 GET, HEADS, OPTIONS gibi okuma işlemi için 1¢(62,941 istek 1.26$ yapıyor.", "\r\n\tSSL kullanırsanız da gene benzer bir ", " var.", "\r\n\tCouchDB için ücretsiz bir alternatif olan ", "'a kesinlikle bakmanızda yarar var.Ufak çaplı uygulamalarda çok rahat kullanılabilir."], "description": [" Couchdb Uygulamalarınız İçin Ücretsiz Bir Alternatif"], "title": ["Ücretsiz Couchdb"]}
{"date": ["02 Temmuz 2012 "], "post": [" Pc Kontrolü İçin Python Ve Arduino Kullanımı", "\r\n\tBu aralar farkettiğiniz gibi kendimi baya bi Arduino'ya kaptırdım.Sürekli kendimi Arduino,Elektronik ve Processing dilinde geliştirmeye çalışıyorum.Bunu bir görev olarak değil de hobi olarak yapıyorum.Gerçekten Arduino insanın ufkunu açıyor.Yapılmış harika projeleri gördükçe insanın yapası geliyor.Geçenlerde Arduino ile olmasada gene ona benzer bir geliştirme kitinde butonlar ile sayfada inip çıkıyordu.Çok hoşuma gitti ve bende bunu Python+Arduino kullanarak yaparım dedim.Mantığını kafamda da Arduino ile seri porttan hangi butona basıldığı bilgisini Python ile alıp xdotool kullanıp sayfada inmek veya çıkmak diye kurdum.", "\r\n\tUfak bir çalışmanın ardından çalıştırmayı başardım.İlerleyen zamanlarda çok daha gelişmişleri yapılabilir.Örneğin benim oyun kolu yapıp PES oynama fikrim var.Onun için bozuk bir oyun kolu arıyorum.Eğer bulamasam da kendim birşeyler yapacağım.", "\r\n\t", "\r\n\tÖncelikle bu projeyi yapmak için devremizi kuruyoruz.Butonlarımızı pull-down veya pull-up şeklinde digital 12 ve 13.pine bağlıyoruz.Bu devre kısmımız oluyor.Daha sonrada işin Arduino tarafına geçiyoruz.Burada ise 12 ve 13.pinimizi giriş kabul ediyoruz.Ve seri iletişimi başlatıyoruz.Butonlardan gelen bilgiye göre de seri porttan 1 veya 2 değerini gönderiyoruz.Bu bize hangi butona basıldığını öğrenmemizi sağlıyacak.", "\r\n\tBu kısımdan sonra Python tarafına geçiyoruz.Ben burada gayet basit ve amatör bir şekilde aşağıdaki kodu kullandım.Bu kod ile seri porttan veriye göre xdotool üzerinden komut çalıştırıyoruz.", "\r\n\tYukarıdaki fark ettiğiniz gibi seri portunuzu değiştirmeniz gerekiyor.Daha sonra python uygulamasını açık bırakıp gezmek istediğiniz sayfaya geçiyorsunuz.Ve aşağıdaki görüntü ortaya çıkıyor.", "\r\n\t", "\r\n\tBen sadece aklınızda bir fikir oluşması için böyle yaptım.Siz processing kullanarak daha kaliteli projeler yapabilirsiniz.Veya benim burada kullandığım xdotool programının diğer fonksiyonlarını kullanarak klavyenize de erişebilirsiniz.Bundan sonrası sizin hayal gücünüze kalıyor.", "\r\n\tBu arada ekstra yeni bir yazı yazmak yerine buradan paylaşayım dedim.Eğer Arduino ile uğraşıyorsanız ", "kütüphanelere iyice bakmanızı öneririm.Özellikle 7 segment display için yazılmış olanı aktif olarak kullanıyorum ve gerçekten çok başarılı."], "description": [" Pc Kontrolü İçin Python Ve Arduino Kullanımı"], "title": ["Arduino İle Basit Pc Kontrolü"]}
{"date": ["04 Temmuz 2012 "], "post": [" Arduino Kullanarak Optik Mouse'tan Bilgi Alma", "\r\n\tBugünlerde aklıma ne geldiyse hep başkaları tarafından yapılmış olduğunu gördüm.Bu beni hem üzdü hemde sevindirdi.Hiç internette olmayan birşey yapamadığım için üzüldüm ama benimle aynı şekilde düşünen insanların olmasıda beni sevindirdi.Bu şekilde olan son olaylardan birisi de optik mouse'un Arduino ile kullanılmasaydı.Geçenlerde evin içinde sensör ararken aklıma gelen optik mouse'ın içini açıp iyice bir inceledim.Olay gayet basitti.ADNS-x serisi bir entegre kullanılarak optik lazer yönetiliyordu.İnternetteki ufak araştırmadan sonra da datasheetine ulaştım.Hemen uğraşmaya başlamadan önce de daha önce böyle birşeyin yapılıp yapılmadığını öğrenmek istedim.Ve tam tahmin ettiğim gibi 2-3 kişi bunu daha önceden yapmıştı.", "\r\n\tBu beni genede üzmedi.Ben bunu yapmaya karar vermiştim bu yüzden optiği uygun bir şekilde lehimledim ve Arduino'ya bağladım.Genelde optik mouseların bağlantı şekilleri aynı olduğu için aşağıdaki şekilde sizde bağlayabilirsiniz.(Hepsi bir değil bu yüzden datasheetine bakmakta fayda var)", "\r\n\t", "\r\n\tYukarırda gördüğünüz beyaz kablo ", ", turkuza olan ", ",turuncu olan ", " ve mor olan ise ", " .Benim optik mouse'ım içindekide aynı yukardaki gibi.Genelde de aynı oluyorlar.Optiğin çalışıp çalışmadığını + ve - uçlarına 3v vererek kontrol edebilirsiniz.Mümkünse çok uzun süreli tutmayın çünkü devreye zararı oluyor.", "\r\n\tOptik mouse işini yukarıdaki gibi hallettiksen son iş bunları Arduino'ya bağlamaya geliyor.Clock kablosunu digital 2,data kablosunu da digital 3 kablosuna bağlayabilirsiniz.Bunun sebebi internetteki tüm kaynaklarda bu şekilde yapılmış.Siz farklı yerlere bağlarsanız kodların hemen üstündeki kısımları değiştirmeniz gerekir.Bunu unutmayınız.", "\r\n\tMouse'un + kısmına 5v ve - kısmına da toprağı bağladıktan sonra Arduinoyu açabilirsiniz.Eğer herhangibi bir yanlış yoksa mouse'un çalıştığını göreceksiniz.", "\r\n\tAsıl iş bundan sonra başlıyor.Bu optik mouse ile webcam yapma şansınızın olduğu gibi mouse'un hızını ve kordinatlarınıda bulabilirsiniz.Bundan sonrası sizin tercihiniz.Ben 3ünüde denedim ve hepsine başarılı oldum.Aralarında birtek webcam ubuntu 64 bit olduğu için çok uğraştırdı.Diğerleri için pek uğraşmadım.", "\r\n\tŞimdi sıra Arduinomuzu programlamada.Öncelikle ", " dosyamızı indirip açıyoruz.Ben bunu yabancı bir siteden aldım ancak çalıştıramadım.Çünkü içinde birçok hata vardı.Bazı düzeltmeler ile çalışır duruma getirdim.Aldığım kişiye de düzeltmeleri bildirdim.", "\r\n\tSizin Ubuntu kullandığınızı varsayıyorum.Bu yüzden indirdiğiniz dosyaları /usr/share/arduino/ dizinine atmanız gerekli.Windows kullanıcılarının ne yapması konusunda tam bir fikrim yok.Ancak onlarda büyük ihtimal program files klasörüne atmaları gerekiyor.", "\r\n\tBu işlemi yaptıktan sonra Arduino IDE'sini yeniden başlatın.Tekrardan açıldığında ", " seçeneği altındaki ", " dizininden ", " veya ", " uygulamasını açabilirsiniz.Açtıktan sonra direk Arduino içine yükleme yapmayınız.Uygulama içerisinde Serial Port hızını kendinize göre ayarlayınız ve upload ediniz.", "\r\n\tEğer herşey yerli yerinde ise serial monitoru açtığınızda(Coordinates uygulamasını açtığını farz ediyorum) önünüze mouse'tan gelen kordinat bilgileri görünmesi lazım.", "\r\n\t", "\r\n\tBu şekilde bir kullanım sizin için yeterli değilse ", " veya ", " kamera yapımlarına bakabilirsiniz.Ubuntu 64 bitte java dosyasının sorun çıkardığını söyleyim.Bu yüzden Windows üzerinde deneyiniz.Processing ile yazılmış olanda herhangibi bir sıkıntı çıkmıyor."], "description": [" Arduino Kullanarak Optik Mouse'tan Bilgi Alma"], "title": ["Optik Mouse İle Arduino Kullanımı"]}
{"date": ["08 Temmuz 2012 "], "post": [" Arduino'yu Arduino'nun Yapımcılarından Dinleyin", "\r\n\tArduino bildiğiniz gibi açık kaynak kodlu bir donanım geliştirme platformu.Açık kaynak kodlu yazılımlardan sonra donanım alanında da gün geçtikçe açık kaynak kod gönüllere taht kuruyor.Açık kaynak kodlu olmasından dolayı tüm dünyadaki geliştiricilerle birlikte gerçekten çok güzel işler yapabiliyorsunuz.İşte Arduino'da böyle bir platform.Dünya'nın birçok yerindeki hobi elektronik tutkunu Arduino ile projeler geliştiriyor ve bunları paylaşıyor.Haliyle Arduino'da geliştikçe gelişiyor.Tabi diğer geliştiricilerin yanında bunda yapımcılarında büyük parmağı var.Arduino'nun bu hikayesini Arduino'nun yapımcılarının ağzından duymak isterseniz aşağıdaki Arduino Belgeselini izleyebilirsiniz.", "\r\n\t"], "description": [" Arduino'yu Arduino'nun Yapımcılarından Dinleyin"], "title": ["Arduino Belgeseli"]}
{"date": ["02 Haziran 2012 "], "post": [" Blogunuzdaki Yazıları Twitterda Takipçilerinizle Paylaşın", "\r\n\tBildiğiniz gibi Twitterın bir çok apisi piyasada dolaşıyor.Hem kendi elemanları hemde bağımsız programcılar tarafından birçok apiler geliştiriliyor.Bugün sizlere çok kullanışlı olan bir apinin kurulumundan bahsedeceğim.Bu api ile blogunuzda veya sitenize yazdığınız yazının daha fazla hit ve yorum alacağını kendi gözlerinizle göreceksiniz.Kurulum için birkaç açıklama yapıcam.Bunları okuduktan sonra kuruluma geçebilirsiniz.", "\r\n\tBu api için öncelikle bir Cron Job oluşturmalısınız.Cron Job ile zaman ayarlı görevle oluşturabilirsiniz.Eğer böyle bişey istemiyorsanız manuel olarakda çalıştırabilirsiniz.", "\r\n\tGeliştiricinin kendi sitesinden anlatımı için ", ".", "\r\n\tÖncelikle ", " kurulum dosyalarını indiriyoruz.Ve gerekli chmod ayarlarını veriyoruz.(önerilen 644)", "\r\n\tDaha sonra tw.php'yi açın ve ", ", ", ", ", " değişkenlerine Twitter kullanıcı adınızı (", " yerine), şifrenizi (", " yerine) ve kodun ulaşacağı RSS beslemesinin adresini (", " yerine) yazın.", "\r\n\tSonrada kodcugu çalıştırıp test edebilirsiniz.Çalışmadıysa eğer bu yazi altından sorularınızı ve hatalarınızı sorabilirsiniz.Kesinlikle tüm sorulara cevap vermeye çalışacağım."], "description": [" Blogunuzdaki Yazıları Twitterda Takipçilerinizle Paylaşın"], "title": ["Blog Yazılarını Twittera Ekleme"]}
{"date": ["09 Temmuz 2012 "], "post": [" Televizyon Kumandasının Arduino İle Kullanımı", "\r\n\tBundan tam 1 hafta önce bugün Arduino ile nasıl bilgisayarınızı kontrol edebileceğiniz konusunda basit birşey yapmıştım.Onun mantığı seri porttan gelen verileri python ile algılayıp xdotool aracını kullanarak bilgisayara erişmekti.Görünüş olarak bir hayli amatördü.Böyle birşey yapmıştım ama aklımda hep kumanda ile kontrol vardı.Nasıl bunu yaparım diye düşünüyordum.Tam bu düşünceden vazgeçmişken evden atılacak bir parçanın içinde kızıl ötesi alıcı(IR Detector) gördüm.Hemen dikkatlice söküp internette biraz araştırma yaptım.", "\r\n\tBu alıcı ile istediğim şeyi yapabilirdim.Aynı geçenlerde yazdığım kodun birazcık daha gelişmişi ile daha kaliteli birşey yapabileceğimi düşündüm.Hemen bu IR alıcı için birkaç kütüphane arayışlarına girdim.Eğer çalışsalardı hepsi işime yarardı ama maalesef hiçbiri çalışmadı.Bende kolları sıvayıp bir tanesini çalışır duruma getirdim.Aslında çok da fazla birşey yapmadım.Sadece şu anda kullandığım sürüm ile uygun bir hale gelmesini sağladım.Bu kütüphane dosyasını ", " indirebilirsiniz.", "\r\n\tİşlerimize geçmeden hemen önce IR Detectorumuzu Arduino ile bağlayalım.Devre aşağıda gördüğünüz gibi gayet basit.", "\r\n\t", "\r\n\tDevremizi kurduktan sonra az önce indirdiğiniz kütüphane dosyasını açıp içindeki klasörü ", " dizinine atıyoruz.IDE'yi yeniden başlattığınızda File-&gt;Examples içinde IRremote klasörünü göreceksiniz.Bu klasörün içindeki ", " dosyası bizim birazdan kullanacağımız için gerekli olan örnek.Siz diğer örnekleride inceleyebilirsiniz.Bunların arasında IR Led ile veri göndermede var.", "\r\n\t", " örneğini Arduinomuza yükledikten sonra seri porttan kızılötesi ile algılanan tüm değerleri göreceksiniz.Evinizdeki her kumanda da her tuşa bastığınızda farklı bir değer çıktığını görebilirsiniz.Benim kullandığım bizim evin televizyonunda aşağıdaki değerler çıkıyor.Örneğin aşağı tuşunda ", ",yukarı tuşunda ", ",sağ tuşunda ", ",sol tuşunda ", " vb.Sizde kullanacağınız kumandanın buton değerlerini bir yerlere not etmenizde fayda var.", "\r\n\tSizin bu kodda değiştireceğiniz yerler en baştaki ", " diye tanımladığım mouse'un hassasiyet değeri ve buton diye belirttiğim yerdeki kumandanızdan gelen buton değerleri.Bu iki yeri kendinize göre değiştirip programı çalıştırabilirsiniz.(Programın çalışması için bilgisayarınızda xdotool kurulu olması lazım. ", " diyerek kurabilirsiniz.)", "\r\n\tYukarıdaki Python programı arkaplanda çalışırken siz kumandanız ile sitelerde rahatça gezebilirsiniz.Şimdilik bu kodda mouse'u ileri,geri,aşağı ve yukarı oynatma,mouse sağ,sol ve ortadaki tekerlek var.Siz bu kodlardan sonra xdotool'un yapabileceklerine iyice bakıp kumandanızın istediğinize tuşuna işlevsellik atayabilirsiniz.Tamamen size kalan birşey.", "\r\n\tTabiki de bu olayı sadece kumanda dan gelen verileri okumak için kullanmanıza gerek yok.Kurduğunuz kütüphane içindeki örneklere bakarak IR Led ile veri gönderimi de yapabilirsiniz.İki devreyi birbiri ile haberleştirebilirsiniz.Veya IR Led ve IR Detector kullanarak kendinize cisim algılayan bir sensör yapabilirsiniz.", "\r\n\tBenim kullandığım kumanda aşağıdaki şekilde.", "\r\n\t", "\r\n\tVe kendi çekimim olan video.(Evet hesap makinesi ile çektim)", "\r\n\t"], "description": [" Televizyon Kumandasının Arduino İle Kullanımı"], "title": ["Arduino Ve Kızılötesi Alıcı"]}
{"date": ["03 Haziran 2012 "], "post": [" En Eski Bilgisayarlardan Olan Eniacın Simulatörü", "\r\n\tBaşlığı görünce sakın şaşırmayın.Gerçekten de Dünya'nın ilk Bilgisayarı olan ENIAC'ın simulatörü var.Java ile kodlanmış bu simulatör ile sanal bir ENIAC yönetiyorsunuz.Programlayıp istediğiniz işlemleride gerçekleştirebiliyorsunuz.Eğer önceden ENIAC hakkında bilgi sahibi değilseniz kullanmakta aşırı zorluk çekersiniz.Çünkü gerçekten kullanması anlaşılması zor bir bilgisayar.Ama ENIAC konusunda en azından bir fikir sahibi olmanızı sağlayacaktır diye düşünüyorum.", "\r\n\tENIAC simulatöre ", " ulaşabilirsiniz.", "\r\n\tEğer simulatörü bilgisayarınza indirmek istiyorsanız ", ".", "\r\n\tENIAC simulatörün ve ENIAC'ın teknik özelliklerine ", " ulaşabilirsiniz.", "\r\n\tENIAC hakkında daha fazla bilgiye ", " ulaşabilirsiniz."], "description": [" En Eski Bilgisayarlardan Olan Eniacın Simulatörü"], "title": ["Eniac Simulatör"]}
{"date": ["16 Ağustos 2012 "], "post": [" Pyqt Kullanarak Yaptığım Tc Kimlik Programı", "\r\n\tAlgoritma deyince aklıma ilk gelen nedense hep Tc Kimlik No algoritması oluyor.Bunun sebebi en başlarda çok ilginç gelmesi ve başlarda çok fazla ilgilenmem.Çünkü bu algoritmayı öğrenince elinize bir kağıt kalem alıp başka kişilerin de Tc Kimlik numaralarının bilinmeyen 2 numarasını bulabiliyorsunuz.Tabi bu algoritma ile sadece kayıp numaralar bulunmuyor.Bir Tc Kimlikten yola çıkarak akrabalarınızın da Tc Kimlik Numaralarına ulaşabiliyorsunuz.", "\r\n\tBen de son günlerde bir hayli fazla bir şekilde PyQt ile ilgilendiğim için aklıma gelen her programı yapmaya çalışıyorum.Bazıları gerçekten işe yarayan şeyler olmasına rağmen bazılarında baya bi saçmalıyorum.Ama sonuç olarak kendimi bu alanda bir hayli geliştiriyorum.", "\r\n\tYaptığım programa geçmeden önce algoritmanın nasıl işlediğini anlatmak gerekirse:", "\r\n\tBu Tc Kimliği doğrulama için kullanılacak olan algoritma.Bir de akraba algoritması var.Buda aynen şu şekilde.", "\r\n\tİşte bizlere verilen Tc Kimlik Numaraları bu şekilde oluşturulmuş.Ben denediğim tüm hepsinde gayet güzel çalıştı.Hatta kendi programımda tüm ailenin tc kimlik numaralarını başarıyla buldu.", "\r\n\tBu kullandığım python kodu.Tüm kodlara ve ui tasarımlarına ", " depomdan ulaşabilirsiniz.Bu algoritma için yazdığım PyQt programın ekran görüntüsü aşağıdadır.", "\r\n\t"], "description": [" Pyqt Kullanarak Yaptığım Tc Kimlik Programı"], "title": ["T.C. Kimlik No Algoritması"]}
{"date": ["03 Haziran 2012 "], "post": [" Linux İçin Güzel Kaynaklar", "\r\n\tKuşkusuz Linux kullanıcıları Windows kullanıcılarına nazaran daha fazla kaynağa sahiptir.Bu kaynaklarda masaüstü uygulamaları,oyunlar,eklentiler,temalar kısacası işletim sistemi için ne lazımsa vardır.Açık kaynak kodlu bir dünya olduğu için sürekli olarakda gelişmeye devam ediyor.Github gibi siteler sayesinde yazılımcılar birbirlerinin yazılımlarını geliştirme fırsatı buluyorlar.Buda tabiki evinde Linux kullanan kişilere yarıyor.", "\r\n\tBugün sizlere Linux kullanıcıları için olmazsa olmaz yazılarımların olduğu güzel linkler paylaşacağım.Her Linux severin kesinlikle aşağıdaki linkleri yer imlerine eklemesinde fayda vardır diye düşünüyorum.", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", "\r\n\t", " ", "\r\n\t", "\r\n\t", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", " "], "description": [" Linux İçin Güzel Kaynaklar"], "title": ["Linux Kaynakları"]}
{"date": ["03 Haziran 2012 "], "post": [" Hızlı Bir İnternet İçin İpuçları", "\r\n\tHızlı İnternet olayı internet çıktığı ilk günden beri bizim gibi kullanıcıların hep ilgi odağı oldu.Sürekli olarak daha hızlı interneti istiyoruz.Önceleri 56K fax modem kullanırken şimdileri fiber kullanıyoruz.Zamanında bir resimin dolması için dakikalar beklerken şu anda bir yanda torrent açık,youtube video izlerken diğer yanda flickr resimlerimize bakıyoruz.Ve bunların hiçbirini takılmadan donmadan yapıyoruz.Yıllar önce böyle birşey olacak deseler eminim kimse inanmazdı.", "\r\n\tBen bu yazımda internet hızından memnun olmayanlar için ufak bilgilendirme yapmak istiyorum.", "\r\n\t", "\r\n\tBence internet için çok önemli bir unsurdur.Kesinlikle TTNET Dnslerini kullanmayınız.Peki hangisini kullanacağız derseniz. Google'ın dnsleri(8.8.8.8 ve 8.8.4.4) veya OpenDNS(208.67.222.222 ve 208.67.220.220) bu işler için idealdir.Bununla yasakli sitelerede girebilirsiniz.", "\r\n\t", "\r\n\tBence çok önemli bir konudur.Hız farkını gerçekten hissedersiniz.Linux Kullanıcıları DnsMasq programını kurup bu farkı yaşayabilirler.Windows için böyle bir program varmı bilmiyorum.Onuda araştırırım.Linux kullanıcıları kurmak için; ", "Komutuyla programı kuruyoruz.Programı kurduktan sonra masaüstü yöneticisinden sistemi açıyoruz.Açtıktan sonra DNS sekmesine geçiyoruz.Buraya 127.0.0.1 i ekliyoruz.Ardından onu en üste taşıyoruz.Ama bir sıkıntı var bilgisayar yeniden başlayınca bu değişecektir.Bunu önlemek için", " dosyasında ", "satırının başındaki # işaretini kaldırın.", "\r\n\t", "\r\n\tPiyasada birçok ücretsiz indirme programları var.Bunları kullanmak hızınıza büyük etki edecektir.En bilinenleri İnternet Download Manager,JDownloader,DownThemAll(Firefox Eklentisi) bunlardır.Bunun yanında FlashGet te kullanılabilir.", "\r\n\t", "\r\n\tBen bugüne kadar pek kullanmasam da piyasada çok fazla var.Bunlardan herhangi birisini indirip deneyebilirsiniz.En bilineni Turbo İnternet e göz gezdirmekte fayda var.", "\r\n\t", "\r\n\tDüzenli olarak internetten inen gereksiz dosyaları temizlemek internet hızını arttırmasa da güzel etki eder.Bunun için CCleaner programını indirip kurabilirsiniz.Bu işi en iyi yapanlardan birisi.Bunun yanında benim favori programım Tune Up ı da indirip kurabilirsiniz.Haftada bir çalıştırmanız bile çok faydalı olur.", "\r\n\tBu kadar çok şey yaptık hala internetim hızlanmadı mı diyorsunuz ? O zaman yapacak tek birşey kaldı.Oda internet sağlayısına gidip paket yükseltmek.Üstteki teknikler çok hızlandırmasa da eminim hissedilebilir bir değişiklik yapacaktır.Özellikle DNS Cache olayını yüklediğim her Linux bilgisayara yaparım.Sizinde yapmanızda fayda görüyorum.", "\r\n\tHazır internet hızında bahsetmişken internet hızınızı ölçebileceğiniz sitelerden de bahsedeyim.Aşağıda en çok bilinenleri var.İstediğiniz bir tanesi seçip kullanabilirsiniz.Bana göre en doğru sonucu speedtest veriyor.Ama siz istediğinizi kullanabilirsiniz.", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", " Yukarıdaki yöntemler ile internet sağlayıcınızın size verdiği internet hızı sınırını aşamazsınız.Sadece o sınır içinde mümkün olduğunca yüksek performans almanızı sağlar."], "description": [" Hızlı Bir İnternet İçin İpuçları"], "title": ["Hızlı İnternet"]}
{"date": ["03 Haziran 2012 "], "post": [" Java Ve Microsoft Dünyası Hakkındaki Gerçekleri Anlatan Video", "\r\n\tJava The Javatar, .NET teknolojisiyle büyümüş bir çocuğun Java ve açık kaynak dünyasına yönelmesiyle birlikte ailesinin buna karşı çıkmasını anlatan bir film.Programlama dünyasının trajikomik hikayesini içeren çok güzel bir yapıt olmuş.Şu anki durumu da çok iyi özetlemiş.Ben gerçekten çok beğendim.Java ve .NET ile uğraşan herkesin izlemesini öneririm.", "\r\n\t"], "description": [" Java Ve Microsoft Dünyası Hakkındaki Gerçekleri Anlatan Video"], "title": ["Java The Javatar"]}
{"date": ["02 Haziran 2012 "], "post": [" İnternet Kullanıcılarının Bağımlı Olup Olmadığını Ölçen Test", "\r\n\tGünümüzün en yaygın hastalıklardından biriside internet bağımlılığı olmaya başladı.Artık evinde interneti olmayan ev kalmadı gibi bişey.Bu rakam gittikçede artıyor.Haliyle böyle oluncada bağımlılar çıkmaya başlıyor.Ivan Goldberg tarafından 1995 yılında ortaya atılan şaka şimdi çok ciddi bir hastalık olarak görülüyor.Eğer sizde böyle bir bağımlılık varmı diye kontrol etmek istiyorsanız aşağıdaki linkten kendinizi test edebilirsiniz.Benim puanım 38 çıktı daha bağımlı değilim", "\r\n\t"], "description": [" İnternet Kullanıcılarının Bağımlı Olup Olmadığını Ölçen Test"], "title": ["İnternet Bağımlılığı"]}
{"date": ["03 Haziran 2012 "], "post": [" Linux Kullanıcıları İçin Konsol Komutları", "\r\n\tLinux aslında komut satırına bağımlı bir işletim sistemi değil.Ama sizde zamanla Linuxu kullandıkça komut satırının ne kadar daha rahat olduğunu anlıyacaksınız.Bir uygulama için klasör klasör dolaşmadan bir iki komutla işimizi halledebiliyoruz.Bunun yanında aradığımız bir dosyayı daha gelişmiş komutlar kullanarak saniyeler içinde bulabiliyoruz.Bunlar sadece bir kaç örnek.", "\r\n\tLinux Komutları Linux kullanıcılarının hayal gücüne bağlı olarak sürekli gelişiyor.İşte o gelişen komutları bir sitede toplamışlar.Gerçekten çok kaliteli Linux Komutlarını barındıran bir site.Ben herhangi bir komut aradığımda Google'dan önce burada arıyorum.Eğer bulamazsam ki çok nadir oluyor o zaman Google'a başvuruyorum.Tüm Linux kullanıcılarının arşivinde olması gereken bir site.", "\r\n\t", " http://www.commandlinefu.com/commands/browse", "\r\n\tTabi yukarıdaki sitede komut aramadan önce basit Linux Komutlarının temel olarak ne yaptıklarını öğrenmek gerekir.Ardından üstteki siteden gelişmiş komutları aramanız size daha faydalı olacaktır."], "description": [" Linux Kullanıcıları İçin Konsol Komutları"], "title": ["Linux Komutları"]}
{"date": ["02 Haziran 2012 "], "post": [" Bildiğiniz Veya Öğrenmek İstediğiniz Dilleri Geliştirmek İçin Siteler", "\r\n\tGünümüzde yabancı dil öğrenmek o kadar önemli bir konuma geldi ki iş başvurusu yaptığınızda ilk olarak bildiğiniz dillere bakılır durumda.Artık ana dilin dışında yeni bir dil bilmek bile çok önemli değil.Çünkü öyle kişiler varki 5-6 dil biliyorlar.Sonuçta onlarda her alanda başarılı oluyorlar.E diceksiniz iyi güzelde kursları çok pahalı nerden bulucaz felan diye.Oda kolay internette bu işleri ücretsiz yapabileceğiniz çok site var.1-2 Ayda sizde yeni bir dil öğrenebilir bildiğinizi geliştirebilirsiniz.Aşağıda populer olan 10 site vardır.Arama motorlarını kullanarak yenilerine ulaşabilirsiniz.", "\r\n\t", "Dünyada 195′den fazla ülkede, 9 milyondan fazla üyeye, 35′den fazla dilde, ücretsiz ve ücretli dil kursları sunan, dünyanın en geniş online dil öğrenme topluluğudur.Benimde Favorimdir. ", "\r\n\t", "Ücretsiz veya ücretli olarak 150′den fazla materyal ve dünya çapında 2 milyondan fazla üye ile öğrenmek istediğiniz dili ana dili olarak konuşanlardan öğrenebileceğiniz dil öğrenme topluluğudur. ", "\r\n\t", "200′den fazla ülkede, 100′den fazla dili ana dili olarak konuşanlardan öğrenebileceğiniz online dil öğrenme topluluğudur. Ayrıca yabancı dil öğretmenleri ve kurslarına da site üzerinden ulaşabilirsiniz.Geniş bir kitleye hitap ediyor. ", "\r\n\t", " Yabancı dil eğitmenleri ile online olarak oluşturulan sınıflar aracılığıyla yeni bir yabancı dil öğrenebilir veya yabancı dilinizi geliştirebilirsiniz. ", "\r\n\t", "Üyelerinin birbirlerine veya eğitmenlerinin profesyonel olarak yabancı dil eğitimi verdiği online dil öğrenme grubudur. ", "\r\n\t", "Üyelerinin hem öğrenci, hem öğretmen olarak birbirlerine yabancı dil öğrettikleri yabancı dil öğrenme topluluğudur. Ayrıca üyeler birbirlerinin aktivitelerini de takip ederek bir sosyal ağ yapısı da sunmaktadır. Belli bir aşamaya kadar ücretsiz olan servis, farklı seviyeler için farklı paketlerle ücretlendirilir. ", "\r\n\t", " Almanca, Fransızca, İtalyanca, İspanyolca, Rusca, Japonca ve Çince dillerini öğrenebileceğiniz, grammer ve kelime eğitimi sunan yabancı dil öğrenme sitesidir. ", "\r\n\t", "Özellikle İngilizce konuşma seviyenizi arttırmak istiyorsanız tam ihtiyacınıza yönelik eğitim vermektedir. Memphis Tennessee ABD'de bulunan İngilizce eğitim merkezindeki deneyimli eğitmenler ile, sabit telefon, cep telefonu veya skype aracılığıyla hızlı,kolay ve etkin İngilizce öğreten ve pratik yaptıran sistemdir. ", "\r\n\t", "Aylık belli bir ücret karşılığında Çince öğrenebileceğiniz sitedir. Uzun yıllardır yayında olan site bir çok kişiye Çince eğitimi vermiş bu alanda kendisini kanıtlamıştır. ", "\r\n\t", " Her seviye için hazırlanmış derslerinin yanı sıra oyunlarla, bilmecelerle, fıkralarla ve daha farklı yöntemlerle İngilizce öğrenmek isteyenler için vazgeçilmeyecek kaynaklardan. "], "description": [" Bildiğiniz Veya Öğrenmek İstediğiniz Dilleri Geliştirmek İçin Siteler"], "title": ["Yabancı Dil Öğrenme Siteleri"]}
{"date": ["02 Haziran 2012 "], "post": [" Birbirinden Güzel Html5 Oyunları", "\r\n\tHtml5'in çıkmasıyla biraz Flash'ın pabucu dama atılmaya başlandı.Ama nasıl atılmasın Html5 getirdiği yeniliklerle resmen çığır açıyor.Html 4.1 ne kadar sağlam ve düzenli kodlansada kodlarda işlev bozukluğu oluşuyor.İşte bu sorunu aşmak için Html 5 geliştirildi.Sadece bu değil browser tabanlı uygulama da yapabileceğimiz bu sistemi tanınmış browserların güncel tüm sürümleri desteklemektedir.Bende sizlere bugün Html5 kullanılarak hazırlanmış oyunlardan birkaç örnek sunucam.İnşallah Beğenirsiniz.", "\r\n\t", "\r\n\t", " Benim bağımlısı olduğum oyun.Motorsikletimizle parkurları geçmeye çalışıyoruz.Bunun yanında kendi parkurumuzuda yapabiliyoruz.Html5'in tüm özelleklirini güzelce kullanmışlar.Dikkatli oynayın bağımlılık yapabilir", "\r\n\t", "\r\n\t", " Bir bulmaca oyunu olan sand trapta amacımız labirenti döndürerek kumu sepete doldurmak.", "\r\n\t", "\r\n\t", "Mükemmel bir aksiyon oyunu olan bored'da amacımız düşmanlardan kaçmak.Space tuşu ile ateş edebiliyorsunuz.", "\r\n\t", "\r\n\t", " Html5 ile kodlanmış satranç oyunu.", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t"], "description": [" Birbirinden Güzel Html5 Oyunları"], "title": ["Html5 Oyunları"]}
{"date": ["02 Haziran 2012 "], "post": [" Masaüstünüzü Renklendirecek Duvar Kağıtları", "\r\n\tÇoğu PC kullanıcısı için hayatında en çok gördüğü şeyler biriside masaüstü duvar kağıdır.Biraz saçma ama istatistikler bunu gösteriyor.Ben her zaman sade bir masaüstü sevdim.Eğer sizde böyle duvar kağıtlarını seviyorsanız bunları paylaşan güzel bir site söyleyeceğim.Bu sitede gözü yormayan sade duvar kağıtları arşivi var.Gerçekten çok şık duvar kağıtları var.Ücretsiz olmasıda cabası.Şu anda bilgisayarımda kullandığım duvar kağıdınıda bu siteden almıştım.", "\r\n\t", " "], "description": [" Masaüstünüzü Renklendirecek Duvar Kağıtları"], "title": ["Masaüstü Duvar Kağıtları"]}
{"date": ["02 Haziran 2012 "], "post": [" Programcıların Kendi Sitesinde Paylaştığı Kodları Renklendirmeye Yarayan Araçlar", "\r\n\tEğer sizde blogunuzda veya sitenizde programlama ile ilgili paylaşımlar yapıyorsanız bu kodlardaki fonksiyonların,döngülerin vb kısımların renklendirilmesinin önemini biliyorsunuzdur.Zaten wordpress'in kendi eklentileri ile bu sorunu aşabilirsiniz.Ama benim gibi kendi kodladığınız siteyi kullanıyorsanız bunun için biraz eklemeler yapmalısınız.Bugün sizlere bu işi gayet güzel yapan birçok \"kod renklendiriciler\" den bahsedeceğim.Genellikle birçoğunun resmi sitesinde bunu nasıl blogunuza entegre edeceğiniz yazar.Bazılarının yazmayabilir.Bunlarıda youtube veya googledan arayarak bularabilirsiniz.Ama çoğunun mantığı aynı.Sayfamıza sırayla css ve js dosyalarını çağırıyoruz.Sonra gerekli yerlerde span ve div tagları ile kodlarımızı renklendiriyoruz.", "\r\n\t", "\r\n\t", "\r\n\t", " (online olarak yapıyor)", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t"], "description": [" Programcıların Kendi Sitesinde Paylaştığı Kodları Renklendirmeye Yarayan Araçlar"], "title": ["Kodlarınızı Renklendirin"]}
{"date": ["03 Haziran 2012 "], "post": [" Rusların En Ünlü Sosyal Medya Platformu", "\r\n\tBaşlık biraz farklı gelebilir bize.Ama Rus halkı için hayatın bir parçası.Bizim ülkemizde Facebook çılgınlığı nasılsa Rus halkı içinde odnoklassniki o.Sosyal medya konusunda iyimi yapmış kötü mü yapmış bilmem ama Rusya'da Facebook kullanan kişi sayısı çok az.Halk zamanının büyük kısmını odnoklassniki de geçiriyor.", "\r\n\tHal böyle olunca bende merak ettim ve üye oldum.Rusçam iyi olmadığı için pek birşey anlamadım ama hoşuma gitti diyebilirim.Eğer Türkçe desteği çıkarsa belki ülkemiz Facebook bağımlılığından kurtulur.", "\r\n\tEğer sizde siteyi merak ettiyseniz ", " ulaşabilirsiniz.Siteyi belki Türkiye'den çok kimse bilmiyor ama Dünya'nın en çok ziyaret edilen 76.sitesi.Buda gerçekten çok yüksek bir rakam ve başarı.Site kullanıcıların eski sınıf arkadaşlarını bulması için açıldı.Ama şu anda belki de bu amaçtan sapıp tamamen farklı bir platform haline geldi.", "\r\n\t", " ye kayıt olmak için "], "description": [" Rusların En Ünlü Sosyal Medya Platformu"], "title": ["Odnoklassniki"]}
{"date": ["15 Haziran 2012 "], "post": [" Yeni Android Canavarım", "\r\n\tUzun bir süredir kendimi android konusunda şartlamıştım.Hatta symbian cep telefonuma android bile kurmuştum(Pek stabil olmadı aynı gün eski sisteme geri döndüm).Bu kötü tecrübemden sonra kendi kendime bir android telefon alma kararı verdim.Ve bir süre araştırma yaptım.Piyasada çok fazla android telefon vardı.Ben biraz fiyat-performans kriterine yoğunlaştım.Şahsen benim için telefonda önemli olan özellikler işlemci,gpu ve ramdi.Buna en uygun Samsung Galaxy Gio ve Samsung Galaxy Ace vardı.İkisi hakkında da çok fazla deneyim raporu vardı.Sırayla bunları okumaya başladım.Ve kesin kararımı bir gün içinde verip telefonuma kavuştum.", "\r\n\tHer ne kadar kime sorsan Ace dese de forumlar ve kullanıcı yorumları bunu demiyordu.Birçok kişi beklentinin altında kaldı tarzında yorumlar yapmıştı.Gio'da ise tam tersi beklediklerinden daha iyi olduğunu belirtiyorlardı.", "\r\n\tSamsung'un resmi sitesinde yer alan deneyim puanlarına göre Ace 4,Gio 4.6 almıştı.Bu belki de kararımda çok etkili oldu.Bunca yorumdan sonra iki telefonunda teknik özelliklerini araştırmaya başladım.Aralarında aşırı bir fark yoktu.Benim dikkat ettiğim konu olan işlemci ve gpu farkı yoktu.", "\r\n\tAce ile Gio arasında fiyat farkı koyan etmen kesinlikle kamera.Onun dışında iki telefon neredeyse aynı.Tabi birde Ace'in ekranı çok ufak bir fark daha büyük.Onun dışında hiçbir önemli fark yok.", "\r\n\tAce 5mp,Gio 3mp kameraya sahip.Forumlarda da Gio'nun en zayıf noktasının kamera olduğunu okumuştum.Buna rağmen onu tercih ettim.Çünkü gerçekten de beni çok ilgilendiren bir özellik değildi.Bunca yıl 0.8 vga ile 1.3mp kamera kullanmış birisi olduğum için 3mp benim için harika bir rakamdı.Aldıktan sonra gerçekten de böyle olduğunu gördüm.Çektiğim resimler benim işimi kat kat görecek kadar kaliteli.Eğer almak düşünenler varsa hiç düşünmesinler bence.Hissedilmeyecek kadar az fark var.", "\r\n\tŞarz olarak birşey diyemeyeceğim çünkü çok uzun bir süre kullandım ve şarzını katlettim.Ve yeni şarzdan çıkardım.Gerçekte ne kadar şarzının gittiğini zamanla öğreneceğim.", "\r\n\tEn soldaki Samsung Galaxy Ace,sağdan ikinci Samsung Galaxy Gio.", "\r\n\t", "\r\n\tTabi bunlar biraz dış görünüş.Gelelim hep hayalim olan android'e.Telefonu aldığım gibi wireless'e bağlanıp markete sömürmeye başladım.Önce belli başlı uygulamar olan facebook,twitter,instagram,forsquare,angry birds,fruit ninja ve guitar solo dan başladım.Zamanla eminim çok fazla uygulamayı test edip sahip olacağım.Zamanla bunları da blogumda paylaşmak istiyorum.", "\r\n\tŞimdilik Samsung Galaxy Gio ile aramız çok iyi.Eminim böyle de devam edecektir."], "description": [" Yeni Android Canavarım"], "title": ["Samsung Galaxy Gio"]}
{"date": ["03 Haziran 2012 "], "post": [" Yepyeni Bir Arama Motoru", "\r\n\tBu ismi yeni duymuş olabilirsiniz.Ama gelecekte çok fazla duyacağınıza eminim.Google'ın Arama Motoru sektöründe şu anda herhangi bir rakibi bulunmuyor.Bing biraz kıpırdamalar yaşasa da Google karşısında pek şansı yok gözüküyor.İşte böyle bir ortama kendinden çok emin bir şekilde Volunia geliyor.", "\r\n\tYakın zamanda duyduğumuz fiyaskolar gibi değil.Ciddi ciddi geliyor.Bunun temelinde de Google'ın şu anda kullandığı PageRank algoritmasını yazan,Google'ın kurucularının daha Google ile alakaları bile yokken konferansına katıldıkları Massimo Marchiori yer alıyor.Bu adam gerçekten de küçümsenecek birisi değil.Şu anda 41 yaşında İtalyan Padua Üniversitesinde bilgisayar ve matematik alanında profesörlük yapıyor.", "\r\n\tGoogle'ın şu anki konumuna gelmesinde ve Google'ın temelinin atılmasında en büyük pay sahiplerinden birisi.Google'ı belkide herkesten iyi biliyor.Bu yüzden onun karşısına çıkabilecek ender kişilerden birisi.Ve o bu fırsatını çok iyi değerlendirecek gibi gözüküyor.Kendsi geliştirilmiş bir \"Google\" değil daha da ötesi birşey yapacağını vurguluyor.", "\r\n\tBu projeye kuzeybaı İtalyadaki Padua kentinde başladılar.Çalışan yazılımcıların çoğu Massimo'nun öğrencisi.Para kaynakları ise Sardinya Ada’lı ve 20 yıldır sektörde bulunan Mariano Pireddu.Başlangıç için yeterli olduklarını söylüyorlar ama zamanla daha fazla yatırımcı ihtiyacı olacağı malum.", "\r\n\tBu projeye ", " ulaşıp mail adresinizi kayıt ettirebilirsiniz.Kayıt ettirdikten sonra tester olmayı bekleyeceğiz.Beta aşaması geçtikten sonra neler olacağını tüm Dünya ile aynı anda öğreneceğiz.Hayırlısı diyelim", "\r\n\t"], "description": [" Yepyeni Bir Arama Motoru"], "title": ["Volunia"]}
{"date": ["22 Haziran 2012 "], "post": [" Vi Editörünü Bulut Servisleri İle Web Üzerinde Kullanma", "\r\n\tVi bana göre Linux için geliştirilmiş en iyi metin editörü.Tabiki de Vi düşündüğünüz gibi bir metin editörü değil.Tamamen kişiselleştirilebilir harika bir program.Zaten linux dağıtımlarının içinde tanımlı olarak geliyor.Vi özellikle sistem yöneticileri için vazgeçilmezdir.Bunun sebebi ise uzak sunucuya ssh ile bağlandığınızda diğer görsel editörleri kullanamıyor olmamızdır.Burada devreye vi giriyor.Bu yüzden bana sorarsanız kesinlikle vi,pico,nano gibi bir editörü iyi derece öğrenmelisiniz.Ben tercihimi vi den yana kullandım ve bunda da yanılmadığımı düşünüyorum.", "\r\n\t", "\r\n\tTabi bu kadar yazdım ama benim gösterip tanıtmak istediğim vi değildi.Ben asıl vi'yi sevip kullananlar için güzel bir uygulamadan bahsetmek istiyorum.Thomas Georgiou adındaki kişi yaptığı uygulama ile browser üzerinde vi'yi kullanmamıza olanak sağlıyor.Browser üzerinde kullanmanın yanında bulut servislerinide en iyi şekilde kullanabiliriz.", "\r\n\tİster kendi pcmizden,istersekte diğer birçok bulut servisinden dosyalarımızı açıp düzenleyebiliriz.Linux kullanıcıları için gereksiz olabilir.Ama zorunluluktan Windows kullanan kişiler için eski alışkanlıklarını devam ettirme şansı sağlıyor.Sizde bu güzel uygulamayı denemek istiyorsanız ", " linke tıklayabilirsiniz."], "description": [" Vi Editörünü Bulut Servisleri İle Web Üzerinde Kullanma"], "title": ["Online Vi Editor"]}
{"date": ["27 Haziran 2012 "], "post": [" Yeniden Giriş Yaptığım Hobi Elektronik Dünyası", "\r\n\tYıllardır robotik ve hobi elektronik konuları bana hep ilgi çekici gelmiştir.Hatta bir süre ciddi ciddi de ilgilenmiştim.Ancak daha sonraları aralara hep başka birşeyler çıkarak uzaklaşmıştım.Ama son birkaç gündür ciddi bir karar verip tekrardan başladım.Ve ilk ciddi adımı atıp Arduinomun siparişini verdim.Şu anda Arduinom ve yanında aldığım ekipmanlar kargoda bana doğru gelmekte.Yarın öğlen saatlerinde de elime ulaşacaklar.Bende hobi elektronik dünyasına yeniden giriş yapacağım.", "\r\n\t", "\r\n\tArduino ne diye merak edenler olabilir.Arduino kafanızda yer alan her türlü elektronik projenizi gerçekleştirmenizi sağlayan bir protip geliştirme aracıdır.Hobi elektronik meraklılarının çok fazla kullandığı bir alettir.Peki piyasada bu kadar çok geliştirme seti varken neden Arduino diyenleriniz olabilir.PIC veya vb yollardan programlama yapmak birçok gereksiz detay ile uğraşmanıza yol açar.Bu yüzden projenizden biraz uzaklaşırsınız.Ama Arduino ile direk sonuç odaklı çalışarak projenizi yaparsınız.Çok temiz bir programlama dili de olduğu için aklınıza gelen herşeyi yapabilirsiniz.", "\r\n\tEğer sizde Arduino ile elektronik proje geliştirmek isterseniz yapmanız gerekenler çok basit.İnternette yer alan birçok elektronik parça satış sitesinden arduinonuzu sipariş edebilirsiniz.Ama direk almadan önce çeşitleri hakkında bilgi sahibi olmanız gerekmekte.Eğer hiçbir bilginiz yok ve sıfırdan başlamak istiyorsanız UNO türü sizin için gayet uygundur.Arduino'da zamanla ilerledikçe üst sürümlere geçersiniz.", "\r\n\tArduinonuzu aldıktan sonra gelen devreyi usb kablosu ile pcye bağlayın.Ve her platform için olan Arduino IDE'sini bilgisayarınıza kurun.Artık herşey hazır.İlk Arduino örneği olan ışık yakıp kapatma uygulamanızı çalıştırın.Eğer ışığı yakıp söndürmeyi başardıysanız yolu yarıladınız.Bundan sonrası çorap söküğü gibi gelecektir.(Bu kadar basit anlattığıma bakmayın aralarda yapmanız gereken birçok işlem var.Belki ilerleyen zamanlar detaylı bir Arduino'ya başlangıç rehberi yapabilirim.)", "\r\n\tÇok yakında Arduino ile yaptığım bütün projelerimi blogumda yayınlayacağım.Takipte kalın."], "description": [" Yeniden Giriş Yaptığım Hobi Elektronik Dünyası"], "title": ["Arduino Maceram"]}
{"date": ["25 Haziran 2012 "], "post": [" Hayal Gücünün Sınırlarının Zorlandığı Bir Bölge", "\r\n\tBilgisayar dünyası o kadar çok yaratıcılığa açık ki neredeyse her gün vay be dedirtecek şeyler ile karşılaşabiliyoruz.İnsanlar kendi ihtiyaçları doğrultusunda yaratıcıklarını kullanarak harika işler yapıyorlar.Bunun güzel bir örneğini de ben bir rus sitesinde gezerken farkettim.Burada bir arkadaş evinde kullanmak için bilgisayarını tahtadan kaplıyor.Ama öyle direk bir kaplama değil.Tasarım olarak gayet başarılı ve en az yer kaplayacak şekilde yapıyor.Bana çok harika geldi.Sizlerinde beğeneceğini düşünüyorum.Bu arkadaşın yaptığının aynısını değilde benzerleri için bize örnek oluşturabilir.", "\r\n\t", "\r\n\t", "\r\n\tYapım aşamalarını anlatan bütün resimlere ", " ulaşabilirsiniz."], "description": [" Hayal Gücünün Sınırlarının Zorlandığı Bir Bölge"], "title": ["Bilgisayar Dünyası"]}
{"date": ["02 Haziran 2012 "], "post": [" Online Kaleidoskop Uygulaması", "\r\n\tGeçenlerde ansiklopedi okurken gözüme bu farklı isimdeki şey çekti.Çünkü hayatımda ilk kez duyuyordum.Neyle karşılaşacağımı bilmeden okumaya devam ettim.Çok ilginçti gerçekten.Çok eskilerde teknolojinin olmadığı zamanlarda bir adam çocukları eğlendirmek için ışık yanılmalarını kullanarak bir oyuncak yapmış.Şu anda dünyada unutulmaya yüz tutmuş hatta çoğumuzun ismini bile duymadığı bu oyuncak zamanında çok populermiş.", "\r\n\tAtalarımız bu oyuncakla büyümüşler.Ama kaç kuşak öncesi.Neyse bu oyuncak hakkında birkaç resim ve bilgi vereyim istedim.Eğer sizinde ilginizi çekerse online olarak bu aleti inceleyebilirsiniz.Satın almak isterseniz Türkiyede çok az yer bulunuyor haberiniz olsun.", "\r\n\tOnline Kaleidoskop İçin ", "\r\n\tHazır Yapılmış Bir Örnek İçin ", "\r\n\tİngilizce Bilgi İçin "], "description": [" Online Kaleidoskop Uygulaması"], "title": ["Online Kaleidoskop"]}
{"date": ["28 Haziran 2012 "], "post": [" Günlerdir Beklediğim Arduino İle İlk Tanışmam", "\r\n\tBir önceki yazımda Arduino siparişi verdiğimi ve beklemede olduğumu yazmıştım.Bugün öğlen saatlerimde yeni misafirim elime ulaştı ve hemen kurcalamaya başladım.Aldığım setin içinden çıkan Arduino kitabınada sert bir giriş yaptım.Ve hemen hızlıca okumaya başladım.Arduino'nun dilinin tam tahmin ettiğim gibi C tabanlı olduğunu gördüm.Buda programlama kısmında pek uğraşmayacağım anlamına geliyor.", "\r\n\tAldığım set ile birlikte birçok diyot,direnç,transistör,pil,pil başlıkları,display,led,lcd,motor vb elektronik devre elemanlarıda aldım.Bu sayede hemen kitaptaki projeleri yapmaya başladım.İlk projemi kitaptan bağımsız kendim yapmak istedim.", "\r\n\tBu projede okuldayken robotik derslerinde gördüğüm pull-up,pull-down devreleri ile birlikte led ve buton kullandım.Ve ledin açık veya kapalı olduğunu da seri haberleşme kullanarak bilgisayarıma bildirdim.Bence başlangıç için gayet iyi oldu.Zamanla bütün elektronik devre elemanları ile ilgili güzel projeler yapacağım.Onlarıda paylaşırım artık.", "\r\n\tİlk yaptığım projenin kodları aşağıda.", "\r\n\tDevre için Arduino'nun aşağıdaki gördüğünüz gibi 13. pinine ledi,12. pinine butonu bağladım.Buton Pull-Down devresi için 10 kohm direnç ve led ile seri bağlı 470 ohm dirençten faydalandım.Devreyi aşağıda görebilirsiniz.", "\r\n\t", "\r\n\tVe butona bastığımızda aşağıdaki gibi bir görüntü oluşuyor.Bunun yanında Arduino IDE'si içindeki Serial Monitoru açtığımızda da Led Acik veya Led Kapali yazilarini görebilirsiniz.Araya koyduğum 1 saniyelik delay ile butona basmanızdan 1 saniye sonra led yanıyor cekmenizden 1 saniye sonra sonuyor.Bunuda Serial Monitordeki yazı karmasasını önlemek için yaptım.", "\r\n\t", "\r\n\tİlk deneme için bence gayet başarılı bir uygulama oldu.Zamanla daha fazla karmaşaya gireceğimi hissediyorum.Buda bana ayrı bir gaz veriyor.İnşallah hepiniz bir gün Arduino ile tanışma fırsatı bulursunuz."], "description": [" Günlerdir Beklediğim Arduino İle İlk Tanışmam"], "title": ["Yeni Misafir İle İlk Tanışma"]}
{"date": ["02 Haziran 2012 "], "post": [" Kendiniz İçin Qr Kod Üretin", "\r\n\tResmi görünce biraz şaşırmış olabilirsiniz.Ama korkmayın o benim sitemin QR kodu hali.Bu QR kodlar 1994 yılında kişisel verilerin aktarılması için geliştirilmişti.Şu anda Dünyadaki akıllı telefonların inanılmaz derecede çoğalması ve populerleşmesi ile QR kodlarının da önemi bir o kadar arttı.QR Koduna ne yüklerseniz o bilgiyi taşır.Eminim gelecekte daha fazla kullanılır olucak.QR kodları hakkında daha fazla bilgi için bu kodu bulan kişinin sitesine bakabilirsiniz.", "\r\n\tQR kodlarınıza ister sitenizi ister Facebook hesabınızı istersenizde Google+ hesabınızı ekleyebilirsiniz.Böylelikle tüm bilgilerinizi bir kodda taşırsınız.İnternette kendi QR kodunuzu oluşturmak için birçok site var.Sizde kendi isteğinize göre oluşturabilirsiniz.", "\r\n\t", " Gayet güzel bir platform olmasına rağmen bazı telefonlarda okunamıyor.Ama genede çok güzel bir uygulama.", "\r\n\t", " QR kod üretmede çok başarılı bir uygulama olmuş.Ancak bazı pixellerde sorun yapabiliyor.Ama genede kullanışlı bir uygulama olmuş.", "\r\n\t", " Benim favori uygulamam.Tek sorunu çok fazla seçenek olması olabilir.Ama bunuda sorun olarak nitelendirmeyelim.Alanında en iyisi olma yolunda diyebiliriz.", "\r\n\t", " Çok basit bir uygulama olmasına rağmen işinizi görür.", "\r\n\t", " Text tabanlı güzel kodlar oluşturabilirsiniz."], "description": [" Kendiniz İçin Qr Kod Üretin"], "title": ["Kişisel Qr Kod Üretme"]}
{"date": ["02 Haziran 2012 "], "post": [" Web Programcıların Kullanması İçin Harika Jquery Araçları", "\r\n\tJquery çıktığı ilk günden bugüne hala çok populer.Birçok webmaster Jqueryden faydalanıyor.Benim siteminde birçok kısmında bu kodlardan var.Bende bugün sizlere jquerynin en işlevsel arayüzü bileşenlerinden oluşan Jquery Tools koleksiyonunu paylaşıcam.Tarih seçiciler (datepicker), ipucu balonları (tooltips), form kontrolleri, tablar gibi daha onlarca işe yarar örnek detaylı anlatımlarıyla birlikte koleksiyonda mevcut.Arşivinizde bulunmasında fayda var.", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", " "], "description": [" Web Programcıların Kullanması İçin Harika Jquery Araçları"], "title": ["Webmasterlar İçin Jquery Tools"]}
{"date": ["02 Haziran 2012 "], "post": [" Web Tasarımcıların İşlerini Bir Hayli Kolaylaştıran Css Frameworkler", "\r\n\tEğer sürekli web siteleri veya hazır şablonlar oluşturuyorsanız bunlara sıfırdan başlamanın ne kadar sıkıcı olduğunu biliyorsunuzdur.İşte CSS Frameworkler bu sıkıntıdan kurtarıyor bizleri.Sadece bununlada kalmayıp bizlere ciddi derece zaman kazandırıyorlar.Bunları kullanmadan önce dikkat etmeniz gereken birkaç husus var tabiki.Aşağıya yazdığım Frameworkler ücretsiz lisanslıdırlar.Ancak sadece bireysel kullanımlarda.Ticari kullanımlar için ücret ödemeniz gerekmektedir.", "\r\n\t1)", "\r\n\t2) ", "\r\n\t3) ", "\r\n\t4) ", "\r\n\t5) ", "\r\n\t6) ", "\r\n\t7) ", "\r\n\t8) ", "\r\n\t9) ", "\r\n\t10) ", "\r\n\t11) ", "\r\n\t12) ", "\r\n\tAçıklamalı birkaç örnek için ", " ve kendi frameworkunuzu yazmak isterseniz ", " bakabilirsiniz."], "description": [" Web Tasarımcıların İşlerini Bir Hayli Kolaylaştıran Css Frameworkler"], "title": ["Css Frameworkler"]}
{"date": ["03 Haziran 2012 "], "post": [" Ubuntu Dünyasında Yeni Olanlar İçin Öneriler", "\r\n\tBüyük bir değişiklik yapıp Windowstan Ubuntuya geçtiniz.Ancak daha ısınamadınız.Çünkü birçok şey eksik.Bazı şeyler yavaş.Bugün sizlere ubuntu konusunda kesin bilmeniz gereken bazı konulardan bahsedeceğim.Unutmayın linux ve açık kaynak kod dünyası o kadar geniş ki emin olun ne isterseniz fazlasıyla var.Eğer bir konuda ümitsizliğe düştüğünüzde direk windowsa geçmeyi düşünmeyin.Biraz araştırmayla daha önceden aynı sorunla karşılaşmış insanların yazılarını bulabilirsiniz.Açık kaynak kod dünyasına hiçbirşey demiyorum zaten.Uçsuz bucaksız bir dünya.", "\r\n\t", "\r\n\tUbuntu her yeni kurduğumda yaptığım ilk işlerden birisi depoların tümünü açmaktır.Sizde böyle yaparak daha fazla programa ulaşabilirsiniz. Bunun için sırayla; ", " Girin. Ardından ", " kısmına tıklayın.Açılan pencerede tüm kısımları işaretleyin.Son olarakta Third-Party Software Penceresine gidip orada da tüm seçenekleri işaretleyiniz.Pencereleri kapayıp Reload tuşuna basarak depoları güncelleyebilirsiniz.", "\r\n\t", "\r\n\tEğer sizde her açılışta Grub Menu'nun o sıkıcı siyah ekranından sıkıldıysanız bu madde tam size göre.Bunun yanında Ubuntunun yanında başka işletim sistemide varsa Grub menuden çekeceğiniz vardır.Bu sorunları halletmek için Startup Manager tam size göre.", "\r\n\tBu komut ile kuruyoruz.Kurduktan sonra çalıştırman hemen önce grub dosyanızın yedeğini almakta fayda var.", "\r\n\tProgram kurulduktan sonra Grub menuyu zevkinize göre düzenleyebilirsiniz.Zamanında işime çok yaramıştı.", "\r\n\t", "\r\n\tAslında linux güvenlik olarak tatmin edici de olsa.Genede eşeğinizi sağlam kazığa bağlayın.Sonra başınız yanmasın.Ubuntu için bu işi iyi yapan GUFW var.Sizde eğer lazım görüyorsanız kurabilirsiniz.", "\r\n\tBunun yanında alternatif olarak aşağıdaki firewallı da kullanabilirsiniz.", "\r\n\t", "\r\n\tGeldik linux için bugüne kadarki belkide en yararlı yazılıma.Wine bir windows emulatörüdür.Kısacası sanal bir windows ortamı yaparak .exe gibi windowsa özgü dosyaları açmanızı sağlar.Her linux pcsinde bulunması gerekir.İlerde işiniz düşebilir.", "\r\n\t", "\r\n\tÇok gerekli hatta zorunludur.Kurduğunuz her Linuxa ilk bunu yapın desem yalan olmaz.Flash Player,Java,Codecler vs hepsi bunun içindedir.", "\r\n\t", "\r\n\tUbuntu için görsel düzenlemeler,sistem ayarları gibi gerekli konularda değişiklik yapmamıza olanak sağlayan programdır. Kurulum için önce", "\r\n\tKomutunu çalıştırıp bu dosyanın içine aşağıdaki kodları yapıştırın.", "\r\n\tSon olarakta aşağıdaki komutlarla depoları güncelleyip ubuntu tweakı kurun.", "\r\n\t", "\r\n\tDuymayan varmıdır bilmemde Linux platformların vazgeçilmez Media Playerıdır.Bu yüzden kurmakta fayda var.", "\r\n\t", "\r\n\tÇok hoşuma giden bir uygulamadır.Benim önerim kesin kurun.", "\r\n\t "], "description": [" Ubuntu Dünyasında Yeni Olanlar İçin Öneriler"], "title": ["Ubuntu"]}
{"date": ["03 Haziran 2012 "], "post": [" Mustafa Kemal Atatürkün Yenilenmiş Videosu", "\r\n\tUlu önder Atatürk'ün son teknoloji ile yeniden düzenlenmiş videosu yayınlandı.Hayat duruşu ve profiliyle örnek aldığım atamın videosu gerçekten insanın gözlerini yaşartıyor.Zaten çok fazla söylenecek laf yok.Videoyu her kim düzenlediyse gerçekten ellerine sağlık diyorum.Büyük bir işçilik var.Duygu dolu seyirler dilerim.", "\r\n\t", "\r\n\t"], "description": [" Mustafa Kemal Atatürkün Yenilenmiş Videosu"], "title": ["Atatürkün Yeni Videosu"]}
{"date": ["03 Haziran 2012 "], "post": [" Ücretsiz Bulut Hosting Arayanlar İçin Güzel Kaynak", "\r\n\tSon günlerde artık çok fazla duymaya başladığımız bir kelime bulut bilgisayarlar.Türkçeye çevrilmiş haliyle çok garip duruyor ama zamanla alışacağız.Yabancıların Cloud Computing dediği bu sistem bir bilgisayarın kaynaklarının sanallaştırma yazılımlarıyla birçok kaynağa paylaştırılması anlamına geliyor.Eğer bu sistemi daha yakından tanımak için ücretsiz hosting aradıysanız hüsranla karşılaşmışınızdır.Bu yüzden sizlere bu alandaki en iyi site olan dotcloud sitesinden bahsedeceğim.", "\r\n\tŞu anda 19 adet servisi destekleyen dotcloud bazı kısıtlamalar dışında paralı birçok hostingten daha kaliteli bir hizmet veriyor.Bu servislerle çok ünlü wordpress,wiki vb gibi sistemleride tam performansla çalıştırabiliyorsunuz.Dotcloud sistemini kullanan örnek sitelere ", " ulaşabilirsiniz.", "\r\n\tDotcloud'un fiyatlandırma politikasıda saniyede yaptığınız işlem başına göre değişiyor.Eğer saniyede 1000 işlem yapan çok büyük bir siteniz yoksa dotcloud tüm işleriniz için yeterli olacaktır.", "\r\n\tBu sistemi kullanmak için önce ", " kayıt olun.Sonra ayarlar sayfasından api anahtarınızı bir yere not alın.", "\r\n\tBundan sonra Linux sisteminizde dotcloud clienti kurucağız.Bunun için önce pip paketini kuruyoruz. ", "\r\n\tBurada Python ile postegresql servisini kullanıyoruz. Bununla ilgili sitenin ayrıntılı dökümanlarına ", " ulaşabilirsiniz. Projeniz bitincede aşağıdaki komut ile siteye upload ediyoruz. ", "\r\n\tCloud computing hakkında detaylı bilgi için ", ",Türkçe kaynak İçin ", " bakabilirsiniz.", "\r\n\t", "\r\n\t"], "description": [" Ücretsiz Bulut Hosting Arayanlar İçin Güzel Kaynak"], "title": ["Ücretsiz Bulut Hosting"]}
{"date": ["03 Haziran 2012 "], "post": [" Üniversite Tercih Etmeden Önce İzlemeniz Gereken Tanıtım Videoları", "\r\n\t5 Ağustos itibariyle tercih dönemi bitti arkadaşlar.Bundan sonra amansız bir bekleyiş başladı.Acaba istediğim gelcekmi yoksa süpriz mi olcak düşünceleri kafamızı yemeye başladı.Artık rahatlamak lazım çünkü geri dönüşü ancak bir senede yapılacak bir süreci bitirdik.Birazda bekleyelim.Bende beklerken üniversitelerin tanıtımları için birkaç video izlersiniz diye düşündüm.Bulabildiklerim bunlar.Yeterli olur diye düşünüyorum.", "\r\n\t"], "description": [" Üniversite Tercih Etmeden Önce İzlemeniz Gereken Tanıtım Videoları"], "title": ["Üniversite Tanıtım Videoları"]}
{"date": ["20 Haziran 2012 "], "post": [" Bilgisayar Donanımlarını Resimli Anlatan Güzel Bir Resim", "\r\n\tBilgisayar kullanıcıları yazılımı bilmenin yanında bana sorarsanız donanımı da o kadar iyi bilmelidirler.Sonuçta kullandığınız bilgisayara tam hakim olmak çok önemlidir.Kasanın içindekilerini ve görevlerini bilmek eminim size çok fayda sağlayacaktır.Bu yüzden daha yeni redditte gördüğüm harika resmi paylaşmak istedim.Yapan kişi gerçekten çok uğraşmış.Resim 4320*6120 ebadında ve 24mb civarında.Resmin ne kadar büyük olduğunu eminim bu rakamlar yeterince anlatmıştır.", "\r\n\t", "\r\n\tResmin full boyutlu haline ", " veya yukarıdaki resme tıklayarak ulaşabilirsiniz.Bana sorarsanız kesinlikle arşive alınacak bir resim olmuş.İlerde bir gün işiniz düşebilir.Veya kaliteli bir yazıcıdan çıkarıp odanıza poster olarak asabilirsiniz.Tercih size kalmış."], "description": [" Bilgisayar Donanımlarını Resimli Anlatan Güzel Bir Resim"], "title": ["Bilgisayar Donanımları"]}
{"date": ["06 Haziran 2012 "], "post": [" Rus Hackerlar Şifreleri Çalıp Forum Sitelerinde Yayınladı", "\r\n\tBirçok büyük şirketin başına gelen zor durumlardan birisi bu seferde Linkedin'in başına geldi.Rus hackerlar siteden tam 6.458.020 adet sha1 ile şifrelenmiş hashı çaldılar.Çalmakla da kalmayıp forum sitelerinde paylaştılar.Bundan sonra da forum üyeleriyle birlik olup şifre kırma çalışmalarına başladılar.Şu ana kadar 500.000 den fazla hash kırıldı.Sürekli olarakta kırılıp birbirleriyle paylaşıyorlar.Dünya üzerinde 160 milyon,Türkiye'de 1 milyon üyesi olduğunu düşünürsek yaklaşık %4lük bir kesimin şifresi çalınmış durumda.", "\r\n\t", "\r\n\tBu haber teknoloji sitelerine düşünce en başta kimse inanmadı.Ancak ilerleyen zamanlarda Linkedin'in twitter sayfasından bu olay doğrulandığı için üyeleri ufak bir endişe kapladı.Şu anda Linkedin görevlileri olay ile ilgili soruşturma yapıyorlar.Çok yakın sürede konu hakkında detaylı açıklama yapacaklarını düşünüyorum.", "\r\n\tBunun yanında 1-2 saat önce de Linkedin'den şifre sıfırla mesajı geldi.En azından şimdilik sorunu çözmüş gibi görüyorlar.Ancak hala kırılmış ve kırılmaya devam eden şifreler var.Biran önce şifre değişimi yapmazsanız hesaplarınızı kaybetmeniz olası.Bu yüzden sizde bir an önce linkedin şifrenizi değiştiriniz."], "description": [" Rus Hackerlar Şifreleri Çalıp Forum Sitelerinde Yayınladı"], "title": ["Linkedin Sızıntısı"]}
{"date": ["08 Haziran 2012 "], "post": [" Takipçilerinize Yeni Yazılarınızı Mail İle Gönderin", "\r\n\tSitem bir süre kapalı kaldığı için eski takipçilerimin birçoğunu kaybettim.Allahtan hepsinin kayıtlı olduğu bir maillistim vardı.Şimdi sitemi tekrardan açtığıma göre bundan onları haberdar etmek lazımdı.Bu yüzden toplu mail göndermeliydim.Bunu piyasada yapan çok fazla kişi var.Ancak onlarda ciddi rakamlar istiyorlar.Zaten benimde maillistim o kadar büyük değildi.Onlara verecek kadar da param yoktu.Bu yüzden bende python kullanarak hepsine toplu mail attım.", "\r\n\t", "\r\n\tBildiğiniz gibi linux ortamında mail göndermek için mail -s komutu var.Bununla mx kaydı yapılmış tüm serverlardan mail atabiliyorsunuz.Bende python ile linuxun bu özelliğini kullandım.Kod olarak çok basit olabilir ama işlev olarak gayet iyi bence.Belki ileride multi-thread ekleyip işlemleri çok daha kısa sürede tamamlattırabilirim.Ama şimdilik aşağıdaki kod işimi gördü.", "\r\n\tAynı dizinde bulunun mailler.txt dosyası içinde mailleri alt alta yazabilirsiniz.Örnek mailler.txt dosyası:", "\r\n\tTabi burada benim karşılaştığım bir sorundan bahsetmek istiyorum.Linux ile Windowsun dosya tipleri farklı olduğu için windows ortamındaki text dosyasını linux ortamında kullanamıyoruz.Bende bunu unutmuştum.Ve dosyayı aynen attığımda python hata verdi ve mailleri göndermedi.Daha sonra aklıma ", " programı geldi.Bununla windows ortamındaki metin dosyasını linux ortamında kullanılabilir hale getiriyoruz.Eminim ilerde sizde bu sorunla karşılaşacaksınız.Şimdiden çözümünü bi yerlere not etmekte fayda var.", "\r\n\tKurulum için", "\r\n\tVeya", "\r\n\tKurduktan sonra dosya dönüştürmek için aşağıdaki komutu girebilirsiniz.(Bu komut windows ortamındaki dosyayı linux ortamı için uyarlar)", "\r\n\tVe şimdi bu dosyamızı rahatlıkta yukarıdaki mass mail programımızda kullanabiliriz.", "\r\n\t", "Lütfen programı iyi niyetli amaçlar için kullanalım.Spam mail atmak için kullanmayalım."], "description": [" Takipçilerinize Yeni Yazılarınızı Mail İle Gönderin"], "title": ["Python İle Mass Mailer"]}
{"date": ["07 Haziran 2012 "], "post": [" Maillerinizi Gmail Atyapısıyla Kontrol Edin", "\r\n\tEğer sizde benim gibi kaynak tüketim konusunda çok titiz iseniz kendi serverınıza mail,dns vb birçok servisi kurmamışsınızdır.Hatta panel bile kullanmıyorsunuzdur.Şahsen bunların hepsi benim için geçerli.Fazladan ram tüketimini görmek sanki benim için serverımın patlayacağı anlamına geliyor gibi oluyor.Bu yüzden birçok konuda hazıra kaçıyorum.Son olarakta mailleri kontrol etmek için gmail altyapısını kullanmaya başladım.Bence gayette iyi oldu.Eğer sizde böyle birşey düşünüyorsanız daha fazla beklememelisiniz.", "\r\n\tBen dns yönetimi olarak sitemi cloudflare üzerinden yönetiyorum.Bunun sebebi büyük trafik aldığım zaman veya saldırı anında trafiği cloudflare üzerine yönlendirmem.Eğer sizde cloudflare kullanıyorsanız sizin için aşağıdaki adımlar yeterli olacaktır.Ama farklı bir sistem kullanmanız sorun oluşturmaz.Çünkü google apps'e kayıt sırasında detaylı bir anlatım var.", "\r\n\tÖncelikle ", " linke girip google apps'e kayıt oluyoruz.Buradaki adımlarda size google appsı tanıtma amaçlı bir çok yazı göreceksiniz.Bu kısımları şimdilik geçebilirsiniz.Daha sonra dönmek istediğinizde detaylı olarak incelersiniz.", "\r\n\tBuralarda önemli olan kısım dnsleriniz için gerekli ayarları yapmaktır.Eğer cloudflare kullanıcısı iseniz aşağıdaki resimde yer alan kayıtları ekleyiniz.Daha sonra bir süre beklemeniz gerekecek.Bir gün sonra girdiğinizde herşeyin yerli yerine oturduğunu göreceksiniz.", "\r\n\t", "\r\n\tEğer benim gibi mail adında cname eklerseniz maillerinize mail.halitalptekin.com urlsinden ulaşabilirsiniz.Buda bize kolaylık sağlar.Ben bunun yanında Google Docs içinde dosyalar adında ekledim.Sizde eğer kullanmak isterseniz ekleyebilirsiniz.", "\r\n\tDiğer firmalarda da çok fazla bir fark yok.Yukarıda girdimiz mx kayıtlarının aynılarını girerek sizde maillerini taşıyabilirsiniz."], "description": [" Maillerinizi Gmail Atyapısıyla Kontrol Edin"], "title": ["Mail Server Yerine Google Apps"]}
{"date": ["08 Haziran 2012 "], "post": [" Chris Stephenson'un Herkese Hitap Eden Konuşması", "\r\n\tBilgisayar Bilimleri'nin aslında masamızdaki (ya da cebimizdeki) küçük makineyle sadece dolaylı bir bağı var. Temel ve geniş bir bilim alanı. 60 dakika içinde felsefeden cinsiyete, cinsellikten siyasete, sosyolojiden tarihe ve nihayet kaplanın çizgilerine varan bir yolculuk yapacağız. Sizi şaşırtacak en az bir şey öğreneceğinizin garantisini veriyoruz.", "\r\n\tBilgi Üniversitesi CS Bölüm Başkanı Chris Stephenson'ın sadece bilgisayar alanında ilgilenenlerin değil herkesime hitap eden harika videosu.Benimde kafamdaki bazı noksanlıkları tamamlayan bende değeri çok büyük olan videodur.Sizlerinde zamanınızın 1 saatini ayırarak bu videoyu izlemenizi öneriyorum.Eminim çok şey öğreneceksiniz."], "description": [" Chris Stephenson'un Herkese Hitap Eden Konuşması"], "title": ["Bilgisayar Bilimlerinin Başarısı"]}
{"date": ["11 Haziran 2012 "], "post": [" Ufak Çaplı Saldırılar İçin Kendi Serverınıza Ddos Koruması", "\r\n\tDos saldırıları yıllardır olduğu gibi hala çok moda.Hiç beklemediğiniz ülkelerden saldırı alabiliyorsunuz.Bu yüzden tedbiri elden bırakmamak ve güvenliğimizi sağlamak zorundayız.Bunun için piyasa kullanabileceğimiz birçok ücretsiz script var.Bunların arasında en çok bilineni şüphesiz inetbase adlı ddos koruma scripti.Bu script serverda belirli zamanda çok fazla bağlantı açanları apf veya iptables kullanarak banlıyor.Çok büyük saldırılar hariç ufak ve orta çaplı saldırıları önleyebilirsiniz.Kendi VPS veya VDS'nize kurmanızda fayda var diye düşünüyorum.", "\r\n\t", "\r\n\tÖncelikle bilmeniz gereken bu script kesinlikle büyük saldırıları engelleyemez.Bu tarz saldırılara donanım kaynaklarınız imkanlarıyla ortantılı olarak karşı koyabilirsiniz.Ki büyük çaplı saldırılarda koskoca veri merkezleri zarar görüyor.Bir tane site niye görmesin.Ama birkaç site veya serverdan gelen saldırıları inetbase ile engelleyebilirsiniz.", "\r\n\tServerımıza kurulum yapmak için öncelikle ssh ile root girişi yapıyoruz.Ve daha sonraki aşağıdaki 2 komutu çalıştırarak scripti kuruyoruz.", "\r\n\tKurulumu yaptıktan sonra ayarlar için ", " dosyasını açalım.", "\r\n\t", "=0 (Eğer 0 olursa iptables ile 1 olursa apf ile banlar.)", "=150 (150 bağlantıdan sonrasını banlar.Ben 75 kullanıyorum.)", "=600 (10 dakika içinde yukarıdaki sayı kadar bağlantı açanı banlar.)", "=mail@siteadresi.com (Banlanma bilgilerinin gideceği mail adresi.)", "\r\n\tBu ayarlardan sonra aşağıdaki komutu konsola girerek birkaç düzenleme yapıyoruz.", "\r\n\tDdos.conf dosyasının en altına gözardı edilecek ip adreslerini ekleyebiliriz.(Google botları,local ipler gibi)", "\r\n\t", " dosyası içinde aşağıdaki satırı bulun.", "\r\n\tDaha sonra bu satırın altındakileri silip aşağıdaki kodları ekleyelim.", "\r\n\tBöylelikle arka arkaya 4 syn paketi gönderen ip adresini banlıyorsunuz.Bu banlanan ip adresleri sizlere mail olarak gelecek.Eğer banlanan tüm ip adreslerini boşaltmak için aşağıdaki komutu kullanabilirsiniz.", "\r\n\tEğer inetbase kullanmak istemiyorsanız da aşağıdaki uninstall dosyasını indirip çalıştırabilirsiniz."], "description": [" Ufak Çaplı Saldırılar İçin Kendi Serverınıza Ddos Koruması"], "title": ["Serverınıza Ddos Koruması"]}
{"date": ["11 Haziran 2012 "], "post": [" Sonunda Hep Olmak İstediğim Yerdeyim", "\r\n\tBundan tam 1 sene önce YGS ve LYS sınavlarına tek hedef Bilgisayar Mühendisliği olarak girmiştim.Ve sınav sonuçlarından sonra bu hedefime ulaşıp Karadeniz Teknik Üniversitesi Bilgisayar Mühendisliği Bölümünü kazanmıştım.Yıllardan beri olmak istediğim yere tam ulaştım derken 1 sene de hazırlık şartı çıktı önüme.Ve 2011-2012 eğitim döneminini KTU'nun hazırlık sınıfında geçirdim.Bu sayede ingilizcemi geliştirirken üniversite yaşamına da alıştım.", "\r\n\t", "\r\n\tVe hazırlık sınıfımdaki tüm sınavları 1 Haziran günü bitirip memleketime geri döndüm ve sonuçların açıklanmasını beklemeye başladım.Ve işte o sonuçlar bugün açıklandı.", "\r\n\tSonuç olarak artık bilgisayar mühendisliği 1.sınıf öğrencisiyim.Bunun anlamı bu günden sonra blogumda bölümüm ile ilgili konular ve derslere ulaşabilirsiniz.Bunun yanında KTÜ'yü seçmek isteyenler içinde yol gösterici olmak isterim.Takipte kalmaya devam edin."], "description": [" Sonunda Hep Olmak İstediğim Yerdeyim"], "title": ["Ktü Bilgisayar Mühendisliği"]}
{"date": ["07 Ağustos 2012 "], "post": [" Nasa'nın En Zeki Robotu Curiosity Marsa Vardı", "\r\n\t26 Kasım 2011 yılında Nasa'nın şimdiye kadarki en gelişmiş robotu Curiosity fırlatıldığında aklıma takılan soru 2.5 milyar dolarlık bu makinenin mars yüzeyine nasıl iniş yapacağı idi.Çünkü Mars ile Dünya arasında neredeyse 14 dakikalık sinyal ulaşma farkı var.Buda bu canavarı indirmek için dünya kontrollü bir mekanizma yapmayı olanaksız kılıyor.Nasa yetkilileri bu büyük sorunu Earthlings firmasının geliştirmiş olduğu yarım milyon koddan oluşan yapay zeka ile çözdüler.Bu şimdiye kadar gördüğüm en ciddi yapay zeka projesi oldu.", "\r\n\tTabi bu robotun sadece yapay zekası değil üzerinde barındırdığı donanımda gerçekten harika.Enerjisini radyoaktif plütonyumun parçalanmasından elde ediyor.Bu özellik ona uzun süreli kullanım katıyor.Bunların yanında 900 kilogram ağırlığında olması onun hava yastıkları ile inişini imkansız kılıyordu.İşte bu noktada Nasa yetkilileri mükemmel bir frenleme sistemi geliştirdi.Saatteki hızı 21 bin kilometreden fazla olan bu aracın hızını saatte 2 kilometreye düşürdü.Bu bile onun üzerinde ne kadar çok çalışma yapıldığının bir göstergesi.", "\r\n\tCuriosity'nin tamamen başarılı bir şekilde inmesinden sonra artık önünde çok büyük bir engel kalmadı.Artık sadece görevine odaklandı ve Mars üzerinde sonda çalışmaları yaparak yaşam kalıntıları arayacak.Bu kalıntılar arasında tabikide en önemlisi karbon olacak.Eğer karbonda bulunursa bilim dünyasını çok daha heyecanlı günler bekliyor olacak.Artık mutlu haberi almak için bende heyecanla bekleyeceğim.", "\r\n\tBöyle büyük bütçeler ile büyük mühendislik örneklerini çok kısa süreler içinde inşallah ülkemde görmek isterim.Nasa'nın Curiositysi yerine Tubitak'ın geliştirdiği bir robotun Mars yüzeyine inişini ülkece televizyondan canlı izlesek kötü mü olur?", "\r\n\tVe işte o harika robot ile ilgili harika resimler.Tam boyutlu görmek için resme sağ tıklayıp resmi gör diyebilirsiniz.", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t"], "description": [" Nasa'nın En Zeki Robotu Curiosity Marsa Vardı"], "title": ["Yapay Zekalı Curiosity"]}
{"date": ["13 Haziran 2012 "], "post": [" Kırılan Linkedin Şifrelerinin İncelenmesi", "\r\n\tBundan tam bir hafta önce büyük yankı uyandıran Linkedin sızıntısının hasar raporu yavaş yavaş çıkıyor.Tabi herkes şifreleri çalıp paylaşanlar kadar kötü niyetli değil.Bazı kesimlerde bu şifreleri kırıp çoğunlukla kullanılan şifreler ve bunlarla ilgili verileri paylaştı.Bu sayede insanların hala güvenli şifre kullanımı hakkında çok fazla  yol kat etmediğini anladık.Çalınan 6.5 milyon şifreden 1.3 milyon tanesi kırıldı ve raporu paylaşıldı.", "\r\n\t", "\r\n\t", "\r\n\t", " = 1354946", "\r\n\t", "\r\n\tlink = 1808 (0.13%)", "\r\n\talex = 1215 (0.09%)", "\r\n\tmike = 1146 (0.08%)", "\r\n\tjune = 1065 (0.08%)", "\r\n\tjuly = 891 (0.07%)", "\r\n\tjohn = 882 (0.07%)", "\r\n\tchris = 766 (0.06%)", "\r\n\tlove = 749 (0.06%)", "\r\n\tapril = 725 (0.05%)", "\r\n\tmark = 669 (0.05%)", "\r\n\t6 = 281193 (20.75%)", "\r\n\t7 = 211946 (15.64%)", "\r\n\t8 = 444338 (32.79%)", "\r\n\t9 = 203826 (15.04%)", "\r\n\t10 = 121783 (8.99%)", "\r\n\t11 = 51138 (3.77%)", "\r\n\t12 = 24377 (1.8%)", "\r\n\t13 = 9237 (0.68%)", "\r\n\t14 = 4237 (0.31%)", "\r\n\t15 = 1688 (0.12%)", "\r\n\t16 = 1112 (0.08%)", "\r\n\t17 = 37 (0.0%)", "\r\n\t18 = 22 (0.0%)", "\r\n\t19 = 7 (0.0%)", "\r\n\t20 = 8 (0.0%)", "\r\n\t21 = 3 (0.0%)", "\r\n\t22 = 4 (0.0%)", "\r\n\t23 = 4 (0.0%)", "\r\n\t24 = 2 (0.0%)", "\r\n\t27 = 2 (0.0%)", "\r\n\t34 = 2 (0.0%)", "\r\n\t40 = 2 (0.0%)", "\r\n\t8 = 444338 (32.79%)", "\r\n\t6 = 281193 (20.75%)", "\r\n\t7 = 211946 (15.64%)", "\r\n\t9 = 203826 (15.04%)", "\r\n\t10 = 121783 (8.99%)", "\r\n\t11 = 51138 (3.77%)", "\r\n\t12 = 24377 (1.8%)", "\r\n\t13 = 9237 (0.68%)", "\r\n\t14 = 4237 (0.31%)", "\r\n\t15 = 1688 (0.12%)", "\r\n\t16 = 1112 (0.08%)", "\r\n\t17 = 37 (0.0%)", "\r\n\t18 = 22 (0.0%)", "\r\n\t20 = 8 (0.0%)", "\r\n\t19 = 7 (0.0%)", "\r\n\t23 = 4 (0.0%)", "\r\n\t22 = 4 (0.0%)", "\r\n\t21 = 3 (0.0%)", "\r\n\t34 = 2 (0.0%)", "\r\n\t24 = 2 (0.0%)", "\r\n\t27 = 2 (0.0%)", "\r\n\t40 = 2 (0.0%)", "\r\n\t        |                                                               ", "\r\n\t        |                                                               ", "\r\n\t        |                                                               ", "\r\n\t        |                                                               ", "\r\n\t        |                                                               ", "\r\n\t      | |                                                               ", "\r\n\t      | |                                                               ", "\r\n\t      | |                                                               ", "\r\n\t      ||||                                                              ", "\r\n\t      ||||                                                              ", "\r\n\t      ||||                                                              ", "\r\n\t      |||||                                                             ", "\r\n\t      |||||                                                             ", "\r\n\t      |||||                                                             ", "\r\n\t      ||||||                                                            ", "\r\n\t|||||||||||||||||||||||||||||||||||||||||                               ", "\r\n\t00000000001111111111222222222233333333334", "\r\n\t01234567890123456789012345678901234567890", "\r\n\t", "= 281192 (20.75%)", "\r\n\t", "= 937474 (69.19%)", "\r\n\t", "= 417472 (30.81%)", "\r\n\t", " = 411302 (30.36%)", " = 9809 (0.72%)", "= 421111 (31.08%)", " = 122094 (9.01%)", "\r\n\t", "\r\n\tjanuary = 243 (0.02%)", "\r\n\tfebruary = 101 (0.01%)", "\r\n\tmarch = 539 (0.04%)", "\r\n\tapril = 973 (0.07%)", "\r\n\tmay = 3321 (0.25%)", "\r\n\tjune = 1390 (0.1%)", "\r\n\tjuly = 986 (0.07%)", "\r\n\taugust = 500 (0.04%)", "\r\n\tseptember = 142 (0.01%)", "\r\n\toctober = 249 (0.02%)", "\r\n\tnovember = 204 (0.02%)", "\r\n\tdecember = 208 (0.02%)", "\r\n\tmonday = 239 (0.02%)", "\r\n\ttuesday = 54 (0.0%)", "\r\n\twednesday = 15 (0.0%)", "\r\n\tthursday = 41 (0.0%)", "\r\n\tfriday = 217 (0.02%)", "\r\n\tsaturday = 23 (0.0%)", "\r\n\tsunday = 109 (0.01%)", "\r\n\tjan = 4400 (0.32%)", "\r\n\tfeb = 719 (0.05%)", "\r\n\tmar = 23123 (1.71%)", "\r\n\tapr = 1680 (0.12%)", "\r\n\tmay = 3321 (0.25%)", "\r\n\tjun = 2862 (0.21%)", "\r\n\tjul = 3955 (0.29%)", "\r\n\taug = 1391 (0.1%)", "\r\n\tsept = 469 (0.03%)", "\r\n\toct = 993 (0.07%)", "\r\n\tnov = 1539 (0.11%)", "\r\n\tdec = 1112 (0.08%)", "\r\n\tmon = 11372 (0.84%)", "\r\n\ttues = 62 (0.0%)", "\r\n\twed = 439 (0.03%)", "\r\n\tthurs = 82 (0.01%)", "\r\n\tfri = 2268 (0.17%)", "\r\n\tsat = 1226 (0.09%)", "\r\n\tsun = 4036 (0.3%)", "\r\n\t1975 = 1528 (0.11%)", "\r\n\t1976 = 1544 (0.11%)", "\r\n\t1977 = 1580 (0.12%)", "\r\n\t1978 = 1688 (0.12%)", "\r\n\t1979 = 1656 (0.12%)", "\r\n\t1980 = 2016 (0.15%)", "\r\n\t1981 = 1767 (0.13%)", "\r\n\t1982 = 1771 (0.13%)", "\r\n\t1983 = 1560 (0.12%)", "\r\n\t1984 = 1626 (0.12%)", "\r\n\t1985 = 1324 (0.1%)", "\r\n\t1986 = 1019 (0.08%)", "\r\n\t1987 = 882 (0.07%)", "\r\n\t1988 = 721 (0.05%)", "\r\n\t1989 = 663 (0.05%)", "\r\n\t1990 = 639 (0.05%)", "\r\n\t1991 = 588 (0.04%)", "\r\n\t1992 = 521 (0.04%)", "\r\n\t1993 = 581 (0.04%)", "\r\n\t1994 = 632 (0.05%)", "\r\n\t1995 = 729 (0.05%)", "\r\n\t1996 = 769 (0.06%)", "\r\n\t1997 = 803 (0.06%)", "\r\n\t1998 = 929 (0.07%)", "\r\n\t1999 = 1170 (0.09%)", "\r\n\t2000 = 4232 (0.31%)", "\r\n\t2001 = 2211 (0.16%)", "\r\n\t2002 = 2153 (0.16%)", "\r\n\t2003 = 2035 (0.15%)", "\r\n\t2004 = 2316 (0.17%)", "\r\n\t2005 = 2627 (0.19%)", "\r\n\t2006 = 2823 (0.21%)", "\r\n\t2007 = 3165 (0.23%)", "\r\n\t2008 = 4539 (0.33%)", "\r\n\t2009 = 2597 (0.19%)", "\r\n\t2010 = 3372 (0.25%)", "\r\n\t2011 = 1275 (0.09%)", "\r\n\t2012 = 621 (0.05%)", "\r\n\t2013 = 113 (0.01%)", "\r\n\t2014 = 93 (0.01%)", "\r\n\t2015 = 97 (0.01%)", "\r\n\t2016 = 88 (0.01%)", "\r\n\t2017 = 87 (0.01%)", "\r\n\t2018 = 110 (0.01%)", "\r\n\t2019 = 278 (0.02%)", "\r\n\t2020 = 422 (0.03%)", "\r\n\t2008 = 4539 (0.33%)", "\r\n\t2000 = 4232 (0.31%)", "\r\n\t2010 = 3372 (0.25%)", "\r\n\t2007 = 3165 (0.23%)", "\r\n\t2006 = 2823 (0.21%)", "\r\n\t2005 = 2627 (0.19%)", "\r\n\t2009 = 2597 (0.19%)", "\r\n\t2004 = 2316 (0.17%)", "\r\n\t2001 = 2211 (0.16%)", "\r\n\t2002 = 2153 (0.16%)", " = 154193 (11.38%)", " = 290697 (21.45%)", "= 88177 (6.51%)", "\r\n\t0 = 73928 (5.46%)", "\r\n\t1 = 165758 (12.23%)", "\r\n\t2 = 82382 (6.08%)", "\r\n\t3 = 95455 (7.04%)", "\r\n\t4 = 61897 (4.57%)", "\r\n\t5 = 60411 (4.46%)", "\r\n\t6 = 54534 (4.02%)", "\r\n\t7 = 65528 (4.84%)", "\r\n\t8 = 59336 (4.38%)", "\r\n\t9 = 62124 (4.58%)", "\r\n\t |                                                                      ", "\r\n\t |                                                                      ", "\r\n\t |                                                                      ", "\r\n\t |                                                                      ", "\r\n\t |                                                                      ", "\r\n\t |                                                                      ", "\r\n\t | |                                                                    ", "\r\n\t | |                                                                    ", "\r\n\t||||                                                                    ", "\r\n\t||||   |                                                                ", "\r\n\t||||||||||                                                              ", "\r\n\t||||||||||                                                              ", "\r\n\t||||||||||                                                              ", "\r\n\t||||||||||                                                              ", "\r\n\t||||||||||                                                              ", "\r\n\t||||||||||                                                              ", "\r\n\t0123456789", "\r\n\t1 = 165758 (12.23%)", "\r\n\t3 = 95455 (7.04%)", "\r\n\t2 = 82382 (6.08%)", "\r\n\t0 = 73928 (5.46%)", "\r\n\t7 = 65528 (4.84%)", "\r\n\t9 = 62124 (4.58%)", "\r\n\t4 = 61897 (4.57%)", "\r\n\t5 = 60411 (4.46%)", "\r\n\t8 = 59336 (4.38%)", "\r\n\t6 = 54534 (4.02%)", "\r\n\t23 = 36967 (2.73%)", "\r\n\t01 = 26401 (1.95%)", "\r\n\t11 = 22316 (1.65%)", "\r\n\t12 = 20791 (1.53%)", "\r\n\t00 = 19736 (1.46%)", "\r\n\t10 = 15806 (1.17%)", "\r\n\t07 = 12740 (0.94%)", "\r\n\t99 = 12397 (0.91%)", "\r\n\t08 = 11818 (0.87%)", "\r\n\t22 = 11775 (0.87%)", "\r\n\t123 = 27827 (2.05%)", "\r\n\t234 = 7611 (0.56%)", "\r\n\t000 = 6550 (0.48%)", "\r\n\t007 = 6329 (0.47%)", "\r\n\t008 = 4611 (0.34%)", "\r\n\t001 = 4550 (0.34%)", "\r\n\t010 = 3762 (0.28%)", "\r\n\t111 = 3539 (0.26%)", "\r\n\t006 = 2892 (0.21%)", "\r\n\t009 = 2739 (0.2%)", "\r\n\t1234 = 7123 (0.53%)", "\r\n\t2008 = 4219 (0.31%)", "\r\n\t2000 = 3872 (0.29%)", "\r\n\t2010 = 3044 (0.22%)", "\r\n\t2007 = 2922 (0.22%)", "\r\n\t2006 = 2588 (0.19%)", "\r\n\t2009 = 2396 (0.18%)", "\r\n\t2005 = 2371 (0.17%)", "\r\n\t2004 = 2065 (0.15%)", "\r\n\t2001 = 1884 (0.14%)", "\r\n\t12345 = 1785 (0.13%)", "\r\n\t23456 = 926 (0.07%)", "\r\n\t54321 = 171 (0.01%)", "\r\n\t00000 = 153 (0.01%)", "\r\n\t11111 = 143 (0.01%)", "\r\n\t34567 = 104 (0.01%)", "\r\n\t45678 = 89 (0.01%)", "\r\n\t21982 = 88 (0.01%)", "\r\n\t21980 = 85 (0.01%)", "\r\n\t11982 = 84 (0.01%)", "\r\n\t", "\r\n\tloweralphanum: 612169 (45.18%)", "\r\n\tloweralpha: 411302 (30.36%)", "\r\n\tmixedalphanum: 122905 (9.07%)", "\r\n\tnumeric: 122094 (9.01%)", "\r\n\tmixedalpha: 27884 (2.06%)", "\r\n\tmixedalphaspecialnum: 15925 (1.18%)", "\r\n\tloweralphaspecialnum: 12979 (0.96%)", "\r\n\tupperalpha: 9809 (0.72%)", "\r\n\tupperalphanum: 8046 (0.59%)", "\r\n\tloweralphaspecial: 7062 (0.52%)", "\r\n\tmixedalphaspecial: 3010 (0.22%)", "\r\n\tspecialnum: 528 (0.04%)", "\r\n\tupperalphaspecialnum: 433 (0.03%)", "\r\n\tupperalphaspecial: 154 (0.01%)", "\r\n\tspecial: 61 (0.0%)", "\r\n\t", "\r\n\tstringdigit: 618995 (45.68%)", "\r\n\tallstring: 448995 (33.14%)", "\r\n\talldigit: 122094 (9.01%)", "\r\n\tstringdigitstring: 52436 (3.87%)", "\r\n\tothermask: 42087 (3.11%)", "\r\n\tdigitstring: 37555 (2.77%)", "\r\n\tstringspecialdigit: 13438 (0.99%)", "\r\n\tdigitstringdigit: 9672 (0.71%)", "\r\n\tstringspecialstring: 5001 (0.37%)", "\r\n\tstringspecial: 3809 (0.28%)", "\r\n\tspecialstring: 516 (0.04%)", "\r\n\tspecialstringspecial: 287 (0.02%)", "\r\n\tallspecial: 61 (0.0%)", "\r\n\t?l?l?l?l?l?l?l?l: 106882 (7.89%)", "\r\n\t?l?l?l?l?l?l?d?d: 96270 (7.11%)", "\r\n\t?l?l?l?l?l?l: 92814 (6.85%)", "\r\n\t?d?d?d?d?d?d: 78615 (5.8%)", "\r\n\t?l?l?l?l?l?l?l: 70692 (5.22%)", "\r\n\t?l?l?l?l?l?l?l?l?l: 55781 (4.12%)", "\r\n\t?l?l?l?l?l?d?d: 41317 (3.05%)", "\r\n\t?l?l?l?l?l?l?l?l?l?l: 40222 (2.97%)", "\r\n\t?l?l?l?l?l?l?l?d?d: 37483 (2.77%)", "\r\n\t?l?l?l?l?l?l?l?d: 32948 (2.43%)"], "description": [" Kırılan Linkedin Şifrelerinin İncelenmesi"], "title": ["Linkedin Raporu"]}
{"date": ["03 Haziran 2012 "], "post": [" C Programlama Dili İçin Arşivlik Kaynaklar", "\r\n\tProgramlama sadece bilgisayar bilimleri ile uğraşanların değil matematik,fizik,astronomi gibi alanlar ile uğraşanların da vazgeçilmezidir.Ve birçok üniversitede programlamaya C dili ile başlıyor.C programlama dili ile aklınıza gelecek neredeyse herşeyi yapabilirsiniz.Sonuçta işletim sistemleride dahil olmak üzere hala kullandığımız birçok program,programlama dili onunla yazıldı.Emin olun yazılmaya da devam edecektir.", "\r\n\tÇünkü C ile yeni birşeyler yapmak için biraz C bilgisi ve hayal gücü yeterli oluyor.Bunun yanında karşılaştığınız birçok problemi de onunla çözebiliyorsunuz.Eğer sizde bu bu dile başlamak için kaynak arıyorsanız doğru yerdesiniz.Bana göre piyasada bulabileceğiniz en kaliteli ilk 10 kaynak aşağıdadır.Tabi bunlar ücretsiz olanları.Birde ücretli olanları var.Onlarıda ilerleyen zamanlarda paylaşabilirim.", "\r\n\t", " ", "\r\n\t", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", " ", "\r\n\t", " ", "\r\n\tBiraz da görsel kaynak arıyorsanız ", " yazıma bakmanızı öneririm."], "description": [" C Programlama Dili İçin Arşivlik Kaynaklar"], "title": ["C Programlama Dili Kaynaklari"]}
{"date": ["03 Haziran 2012 "], "post": [" Siber Savaş Konusuyla İlgili Virüs İncelemesi", "\r\n\tStuxnet virüsü bu aralar güvenlik uzmanları tarafından en fazla konuşulan konulardan birisi.Çünkü diğer virüslere benzemeyen amacı tamamen siber savaş olan bir bir virüs.Diğer virüs türlerinin amacı daha fazla bilgisayara yayılıp daha fazla bilgisayara zarar vermek.Ama Stuxnet'i diğer virüslerden ayıran nokta da bu.O daha fazla sisteme yayılmak yerine endüstriyel sistemleri gizlice gözetliyor ve yeniden programlayabiliyor.Kısacası tam bir siber savaş askeri.", "\r\n\tİran bu Stuxnet virüsünden zarar gördüğünü resmi olarak açıkladı.Natanz’daki Uranyum zenginleştirme tesisi kapasitesi %15 dolayında düştü.Bunlar aslında çok ciddi olaylar.Artık sanal alemin reel alem üzerinde ne kadar etkili olduğunun birer kanıtları.Her zaman söylendiği gibi fiziksel savaşların yerine siber savaşlar gelicek.Bunun da ilk temsilcilerinden birisi Stuxnet oldu.", "\r\n\t", "\r\n\tStuxnet ilk defa haziran ayının ortalarında Beyaz Rusya'daki küçük bir firma olan VirusBlokAda tarafından tespit edildi. İlk incelemeler virüsün standart bir solucan olmadığını zaten gösteriyordu fakat karmaşık yapısı yüzünden uzayan incelemeler devam ettikçe işin boyutu gittikçe değişti. Özellikle solucanın çok karmaşık yapısı, kullandığı taktikler ve hedefi göz önüne alınınca, siber savaş adı altında yıllarca dillendirilen senaryoların aslında çok da gerçek dışı olmadığı ortaya çıktı.", "\r\n\tStuxneti inceleyen ilk uzmanlar zaten incelemeye başladıkları ilk andan itibaren bu virüsün çok karmaşık bir yapıda olduğunu ve tek bir kişi tarafından değilde arkasında büyük devletlerin olduğu bir grup tarafından oluşturulduğu fikri oluştu.Çünkü virüsün amacı tamamen devletlerin önemli yerlerini etkilemekti.Böyle birşeyi de rakip devletler isteyebilirdi.", "\r\n\tStuxneti önemli yapan bir konuda 4 tane 0-day açığı ile birlikte gelmesi.Bazı virüsler yayılmadan önce 1-2 tane 0day açığı ile birlikte piyasa sürülürdü.Ama Stuxnet bu kuralı bozdu.İlginç olan ise bu açıklardan 2 tanesinin bulunup diğer 2 tanesinin hala bulunamamış olması.Bulunan açıklar aşağıdadır.Bunların yanında geri kalan 2 açık ise Windows sistemler yetki yükseltme açığı.Bana göre de en tehlikeli olanlar.", "\r\n\t", " Asıl olarak işletim sistemindeki bir dizayn hatasından kaynaklanan bu açıklık sayesinde autorun açık olmasa bile bilgisayara takılan bir taşınabilir depolama aygıtındaki dosyaların ikonlarını göstermeye çalışan Windows Gezgini ve benzeri bir programın zararlı bir kodu çalıştırması sağlanabiliyor. Stuxnet’in de asıl olarak bu yöntemle birçok yere bulaştırıldığı düşünülüyor. Ayrıca kendini güncelleme yeteneğine sahip olan stuxnet’e bu özelliğin mart ayında eklendiği ve daha önceden solucanın taşınabilir cihazlardaki autorun özelliği ile bilgisayara bulaştığı düşünülmekte.", "\r\n\t", " Bu açıklığı kullandığı, stuxnet’in daha sonraki detaylı incelemelerinde açığa çıktı. Bu açıklığı kullanarak stuxnet bulaşmış olduğu bir bilgisayardan diğerine atlamayı başarabilmekte. Basitçe bu açıklık bir bilgisayara uzaktan yüksek yetkilerle dosya yüklenilmesine olanak sağlamakta. Daha sonra da bu dosya WBEM’in bir özelliği ile çalıştırılabilmekte. Önce şunu belirtmek gerekir ki bu açıklık yukarıdaki açıklık gibi bir taşınabilir aygıtın takılmasını gerektirmese de açıklıktan yararlanılabilmesi için gereken birçok şartın beraber bulunmasını gerektiği için kullanılabilmesi daha zor olan bir açıklık.", "\r\n\tPeki, bu kadar hazırlık ve çabanın sonucunda yapılmak istenen ne? Stuxnet'in hedefi halihazırda piyasa da bulunan virüsler gibi banka veya online oyun hesap bilgilerinin çalınması, DDOS saldırıları gerçekleştirmek veya spam mail atabilmek için zombi bilgisayar ordusu kurmak ve kiralamak değil. Bunların hepsinden farklı olarak; su kaynakları, petrol platformları, enerji santralleri ve diğer sanayi tesislerinin kontrolü için kullanılan SCADA (Siemens supervisory control and data acquisition) sistemlerini ele geçirip fiziksel kontrol sistemlerinin çalışmasını değiştirmek. Stuxnet eğer bulaştığı bilgisayarda bir SCADA sistemi mevcutsa ilk önce mevcut projelerin kod ve dizaynlarını çalmaya çalışıyor, onun dışında asıl ilginç olan nokta ise stuxnet’in programlama yazılım ara yüzü vasıtasıyla PLC'lere (Programmable Logic Controllers) kendi kodlarını yüklemesi. Ayrıca yüklenen bu kodlar, stuxnet’in bulaşmış olduğu bir bilgisayardan PLC'lerdeki bütün kodlar incelenmek istendiğinde dahi görülemiyor. Böylelikle stuxnet PLC lere enjekte edilen kodları saklayabilen bilinen ilk rootkit unvanına da sahip oluyor.", "\r\n\tBirçok medya raporunda kodlar arasında MYRTUS sözcüğünün geçmesi Stuxnet’in İsrail tarafından oluşturulduğu iddialarına neden oldu. İddiaya göre MYRTUS “Myrtle” yani İbranice’de “Hadassah” olarak geçen mersin ağacına göndermeydi ve Yahudi İran kraliçesi Esther’in doğum adı da Hadassah’tı. Yine kodlar arasında geçen 19790509 sayısının 9 Mayıs 1979 olduğu ve bir başka İranlı Yahudi olan işadamı Habib Elghanian’ın Tahran’da idam edildiği tarih olarak yorumlandı. Öte yandan MYRTUS’un yanlış algılanmış olabileceği, ifadenin sadece “My RTUs” olduğu da iddialar arasında. RTUs “Remote Terminal Units” anlamına gelen SCADA bileşenlerinin kısaltması. İsrail bu konuda açıklama yapmasa da konunun takibi için askeri haberalma birimi kurması siber-savaşın başladığını doğruluyor.", "\r\n\tİran’da ise 30bin IP adresinin saldırıdan etkilendiği ve saldırıların Stuxnet’in farklı sürümleriyle devam ettiği bildirildi. İran Siemens’in antivirüs yazılımının solucanı silmek yerine güncellediğinden kuşkulandığını belirterek kendi temizleme programlarını oluşturacağını açıkladı", "\r\n\tKasım ayı sonunda nükleer programda çalışan iki İranlı bilimadamının bombalı suikaste kurban gitmesi Stuxnet’in arkasında olanların nükleer programı durdurmakla yetinmeyeceği yorumlarını getirdi. BKZ: ", "\r\n\tPeki biz ne yapacağız diye düşünüyorsanız bizim yapacağımız pek birşey yok.Antivürüsümüzü güncellemek(!) ve birazcık dikkatli olmak yeter gibi gözüküyor.Zaten Stuxnetin işi gücü yokta bize mi gelecek.O yüzden biraz rahat olabiliriz.Tutunki geldi o zaman ", " araç ile temizleyebilirsiniz.Ama eğer kurumsal bir ağınız varsa aşağıdaki yazıyı okumanızda fayda var. ", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t", "\r\n\t"], "description": [" Siber Savaş Konusuyla İlgili Virüs İncelemesi"], "title": ["Stuxnet Virüsü"]}
{"date": ["03 Haziran 2012 "], "post": [" Uzun Bir Süreden Sonra Bloguma Tekrardan Kavuştum", "\r\n\tBir önceki blog yazımda bahsettiğim gibi birçok konuda kararsızdım.Artık çok büyük kısmını açıklığa kavuşturdum.Şu anda gezdiğiniz siteyi Django ve Python ikilisiyle kodladım.Tasarımı Bootstrap ile yaptım.Arka planda Uwsgi ve Nginx var.Veritabanı olarakta PostgreSQL kullandım.Kısacası bugüne kadar yapmak istediklerimin çok büyük kısmını yaptım.Ama daha bitmedi.Zamanla siteme daha fazla önem göstermek istiyorum.Eskiden yaptığım hataları da tekrarlamak istemiyorum.Zamanla herşeyin yoluna gireceğinden de eminim.", "\r\n\tŞu anda eski yazılarımı ve reklamlarımı da aldım.Mysqldan PostgreSQL'a geçince insan biraz tuhaf oluyor ama.Zamanla ona da alışırım diye düşünüyorum.Tabi herşey güllük gülistanlıkta değil.Eski yazılarımı aktarırken tarihleri alamadım.Çok saçma bir sorunla karşılaştım.Zamanla onu da çözerim diye düşünüyorum.Ama uzun bir süre böyle devam edeceğim.", "\r\n\tEski sitemde benden tanıtım yazısı alanlarıda yeni siteme aynen aldım.Eğer almayı unuttuğum varsa benimle ", " geçebilir.Veya yeni tanıtım yazısı,text reklam,banner almak isteyen varsa ", " formu doldurabilir.", "\r\n\t", "\r\n\tBu seferki sitemde teknik konulara daha fazla özen göstereceğim.Anasayfada yazdığım ilgi alanlarımın hemen hepsinde yazılar yazmak istiyorum.Belki birçoğu amatör olacaktır ama kendimi böyle geliştireceğimi düşünüyorum.Hatta çok yakın bir zamanda Türkçe Django Blog yapımı derslerine de başlamak istiyorum.", "\r\n\tTabi bunların yanında bölümüm olan Bilgisayar Mühendisliği hakkında da birçok yazı ile karşılaşabilirsiniz.", "\r\n\tSon olarakta şu anda gezdiğiniz sisteme verdiğim ad olan HDBlog'un kaynak kodlarına ", " ulaşabilirsiniz.Eğer sadece html şablon olarak almak isterseniz oda ", " olacaktır.İlerleyen zamanlarda servera nasıl kurulum yapılacağı hakkında da video çekeceğim.İlginiz için teşekkürler."], "description": [" Uzun Bir Süreden Sonra Bloguma Tekrardan Kavuştum"], "title": ["Sonunda Geldim"]}
{"date": ["30 Haziran 2012 "], "post": [" Rss Kaynaklarındaki Veriyi Python Ve Arduino Kullanarak Okuma", "\r\n\tSon birkaç gündür kendimi tamamen Arduino'ya atadım.Elimde olan tüm elektronik devre elemanlarını Arduino ile kullanmaya çalışıyorum.Bunlar cd-romdan çıkan lazerden tutunda,uzak kumanda devreleri,dc motorlar vb olabiliyor.Bunların yanında sürekli aklımda olan birşey de Arduino ile internet kullanımı idi.Bunun yapılması için birçok yerde ethernet shield satıldığını gördüm.Ben yeniden para harcamak yerine sadece ufak bir beyin fırtınası yaptım ve Arduino ile pc seri haberleşiyorsa bu haberleşme sırasında Pythonuda devreye sokarak internete erişebilirim dedim.Bunun hakkında yaptığım araştırmada benim gibi düşünen insanları gördüm ve kodları inceledim.Sonuç olarak RSS kaynaklarından verileri çekip bunları seri porttan Arduino'ya gönderdim ve onunda bu verileri LCD'ye basmasını sağladım.Şimdilik masamda son haberleri gösteren bir LCD'nin olması beni çok mutlu etti.", "\r\n\tEğer sizde Arduino'nuz ile internete erişmek istiyorsanız öncelikle ", " ve ", " kavramlarını iyice öğrenmeniz gerekli.Zaten bunlar gayet basit konular.Bir görüşte öğrenebilirsiniz.Şimdi ben bu konuları öğrendiğinizi varsayıyorum ve kuruluma geçiyorum.", "\r\n\tÖncelikle olayın mantığını iyice anlayalım.Python'un içindeki RSS parser ile RSS kaynağından verileri çekiyoruz.Ve bu verileri LCD'de gözükürken sorun çıkmaması için Türkçe karakterlerden arındırıyoruz.Daha sonra bu verileri seri haberleşme portundan Arduino'ya gönderiyoruz.Bu kısım olayın Python bölgesi.Burada kullandığım kod aşağıdaki gibi.", "\r\n\tYukarıdaki kodda değiştirmeniz gereken 2 yer var.Bunlardan ilki  hltalptkn değişkenindeki RSS adresi ve onun hemen üstündeki serialport değişkenindeki serial port adresi.Bu ikisini kendinize göre ayarladıktan sonra kodu çalıştırabiliriz.Zaten kod sonsuz döngüde olduğu için sürekli olarak yazıları çekip size gösterecektir.", "\r\n\tŞimdi gelelim işin Arduino kısmına.LCD'mizi aşağıdaki gibi bağladığınızı düşünüyorum.(Her LCD'nin bağlanma şekli datasheetlerinde gösterilir.Bunu dikkate alınız)", "\r\n\t", "\r\n\tPotansiyometremiz ile uygun kontrast değerini buluyoruz.Bundan sonra aşağıdaki kodumuzu Arduino'ya gönderiyoruz ve programlıyoruz.", "\r\n\tYukarıdaki kodun mantığıda belli.Seri porttan gelen verileri kontrol ediyor.Eğer veri varsa bunların ilk 16sını üste diğer kısmını alta yazıyor.daha fazla ise şimdilik göstermiyor.Bir ilerki versiyonda kayarak göstericem.Bu haliyle işinizi görür ama.Zaten amaç Arduino'yu internete Ethernet Shield olmadan bağlamak.", "\r\n\tEğer başarı ile yaptıysanız LCD'de aşağıdaki gibi bir görüntü göreceksiniz.", "\r\n\t", "\r\n\tRSS kaynağından yazılar 10 saniyede bir çekilecek ve ekrana basılacak.", "\r\n\t", "\r\n\tUygun kontrast değerini potansiyometre ile ayarlayacağınızı unutmayın.", "\r\n\t", "\r\n\tLCD'nin pinlerini lehimlemek için az uğraşmadım ha :D", "\r\n\t", "\r\n\tHangi yazıların ekrana basılacağını çalıştırdığınız python dosyasında ve serial monitorde görebilirsiniz.Farklı uygulamalarda kullanmanız dileğiyle."], "description": [" Rss Kaynaklarındaki Veriyi Python Ve Arduino Kullanarak Okuma"], "title": ["Python Ve Arduino Haberleşmesi"]}
{"date": ["05 Haziran 2012 "], "post": [" Lamp Ve Wordpress Kullananlara Sitem", "\r\n\tArtık her webmaster sitesinin yeni siteler bölümüne girdiğimde gidip sponsor veya sınırsız hosting almış,lamp ve wordpress kullanan kişisel bloglar görmekten bıktım.Biraz orjinal siteler görmek istiyorum.Tabi bazı siteler temaları ile bu farkı koyuyorlar ama diğerlerine ne demeli.Her yerde satılan ücretsiz veya ücretli wp temalarını alıp hemen sitesine kurup güncel konularda blog yazanlardan bahsediyorum.Bu huylarından ne zaman vazgeçerler bilmiyorum.Ama daha uzun süre devam edeceğinden eminim.", "\r\n\tÇünkü bu siteler ufak seo çalışmalarıyla 2-3 aya pr değerlerini yükseltip alexayı azaltıyorlar.Daha sonra da ver elini tanıtım yazıları,backlinkler vb ticaret konuları.Tamam bu ticarette lazım.Çünkü hosting veya server masrafını cebimizden vermek yerine site kendi kendini çıkarıyor olması güzel birşey.Ama bu kişiler ne hostinge para verirler ne de temaya.Heryerde ücretsizi arayıp hiç yoktan para kazanmak istiyorlar.Ki kazanıyorlar da.", "\r\n\tBelki onlara da kızmamak lazım.Çünkü kim onlara gidip bu dünyada python var django var.Ücretsiz hosting için google apps,heroku(hatta ücretsiz vps) var dedi.Bu konuda sonuna kadar haklılar.Ama birileri bunları onlara söyleseler kaç kişi bu işi yapacaktı ki.Çok az bir kısım.Gene de denemekten birşey kaybetmezdik.", "\r\n\tTabi asıl artık sıkmaya başlayan konu sadece wordpress+lamp değil.Her foruma girdiğimde php'deki birçok güvenlik problemi,yavaşlık problemi gibi konulardan yakınıyorlar ancak gene de kullanmaya devam ediyor.Django gibi az kaynak kullanan şişmeyen ve güvenli bir web framework'tan haberleri olsa eminim şaşıracaklardır.Ki bazılarının bundan haberi var ama üşengeçlikten uğraşmak istemiyorlar gibi görünüyorlar.", "\r\n\tKısacası demek istediğim insanlar LAMP'ın kolaylığına o kadar alışmışlar ki yeni bir sistemle tanışmaktan korkuyorlar.Halbuki bir kez inceleyip diğerlerinin kolaylıklarını farketseler hemen LAMP'ten vazgeçerler ama neyse.", "\r\n\tTabi bunların tek sorumlusu site sahipleri değil.Onlara da kızmamak lazım.Forumlarda sürekli sponsor amaçlı hosting dağıtanlarında bu konuda büyük payları var.Eminim uzun sürelerde devam edeceklerdir.Ama onları da işlerinden vazgeçirmek bu saatten sonra çok zor.", "\r\n\tBu kadar çok olumsuzluğa rağmen birçok kişinin ilerde python ve django'nun getirdiği avantajları görüp kendilerini bu dünyada bulacaklarını düşünüyorum.", "\r\n\tBunca şey diyorum ama zamanında bende çok büyük bir php takipçisiydim.Hatta uzun süreler kullandım.Bir süre wordpress bile kullandım.Ama nedense çok fazla heyecan vermediği için yeni arayışlara çıktım.Daha sonra da Python ve Django ikilisiyle tanıştım.Şu anki durumumda uzun bir süre onlarla kalacağım.Ama ilerde ne olur bilmiyorum.", "\r\n\t", "\r\n\tSize kaba taslak bir rapor çıkarmak gerekirse.Plesk panel veya cpanel boştayken 400 mb civarı ram kullanıyor.Üstüne apache+mysql koyduk mu sistem boştayken tahmini 500 mb ram yer.Birde wordpress kursak 600 deyin siz ona.Tabi bunlar biraz tahmini rakamlar.Ama aşağı yukarı bu civarda oluyor.Bide bunları siz yük durumunda düşünün.Online 100 kişi böyle bir sitede dolaşırken tahminime göre sınırları zorlamaya başlar.Uyarılar ve eksiklikler başlar.Mysql şişer.", "\r\n\tPeki Django+Python+Uwsgi+PostgreSql+Nginx te ne oluyor? Şöyle göstereyim.Aşağıdaki resimler sitemi açtığım ilk gün google analyticste online sayısı 100 iken aldığım resimler.Artık siz düşünün gerisini.", "\r\n\t", "\r\n\t", "\r\n\tKaynak kullanımı djangoyu seçmek için sadece bir neden.Onun dışında o kadar çok neden varki insan işin içine girince anlıyor.Tabi Django'nunda eksikleri var.Ama sürekli geliştirilmekte olan bir sistem olduğu için hiç korkum yok.", "\r\n\tSizde birgün bir değişiklik yapın ve bilgisayarına djangoyu indirip ufak çalışmalar yapmayı deneyin.Sitesindeki orjinal kaynakları iyice inceleyin.Türkçe veya ingilizce bloglarda gezip konu hakkında bilgi sahibi olun.Emin olun bişey kaybetmezsiniz.Hatta kazanırsınız.", "\r\n\tÇok yakında bende django'ya sıfırdan giriş yapıp konularla ilgili screencastler hazırlamak istiyorum.İnşallah bunlar havada kalmaz ve gerçekleştiririm.Takipte kalın."], "description": [" Lamp Ve Wordpress Kullananlara Sitem"], "title": ["Hala Bıkmadınız Mı?"]}
{"date": ["03 Haziran 2012 "], "post": [" Microsoftun Oyun Geliştirme Platformu", "\r\n\tHer ne kadar sıkı bir Microsoft takipçisi olmasam da yaptıkları yenilikleri takip ediyorum.Son günlerde ise Microsoft Fuse ekibinin geliştirdiği projelerden birisi olan Kodu ile yakından ilgileniyorum.Kodu çok gelişmiş özelliklerin yanında programlama bilmeyen birisinin bile kısa sürede kendi oyununu yapabileceği bir uygulama.Çok kısa sürede sizde hayalinizdeki oyunu yapmak istiyorsanız denemekte fayda var.", "\r\n\t", "\r\n\tKoduyu denemek isteyenler ", " indirebilirler.", "\r\n\tKodu resmi web sitesine ", " ulaşabilirsiniz.", "\r\n\t", " ", "\r\n\t", "\r\n\t", " ", "\r\n\t", " "], "description": [" Microsoftun Oyun Geliştirme Platformu"], "title": ["Microsoft Kodu"]}
{"date": ["03 Haziran 2012 "], "post": [" Son Dönemlerde Yaşadığım Kararsızlıklar", "\r\n\tKararsızlık bugünlerde içinde olduğum durumu en iyi şekilde özetleyecek bir kelime.Çünkü hem blogumda hem de ileriki hayatımda kullanacağım platformu seçme noktasındayım.Bunun yanında reel hayattaki vizeler ile uğraşmanın da verdiği etki ile blogumu baya aksattım.Bu da bende baya bir endişe yarattı.Kendimi tekrardan siteme nasıl sevdiririm diye düşünmeye başladım.", "\r\n\tBlogumun yeni versiyonunu Django ile kodlamayı düşünüyordum.Hatta ciddi derece adımlar atıp Django'da bir blog kodlayacak kadar da bilgi sahibi oldum.Ama daha sonraları araya okul girince Django'dan biraz uzaklaştım.Tam bu uzaklaştığım sıralarda Emre ve Fehmican abimin telkinlerine uyarak Play! ile tanıştım.Oda beni cezbetti.Onunla ilgili tek sıkıntım kaynaktı.Ama o kısım çokta ilgilendirmiyordu beni.Tam aradığım platformu buldum derken Play! de sürüm tartışması çıktı.Google grubundaki tartışma benim de aklımı karıştırdı.Ve ben de diğer kişiler gibi yeni sürüm çıkana kadar Play! ile uğraşmayı durdurdum.", "\r\n\tPlay! den sonrada Rails'e merak sardım.Evet istediğim bu olabilirdi.Çünkü hem hızlı hem de kolaydı.Onunla da ilgili kaynaklar bulup indirdim.Ancak ona da başlamaya nasip olmadı.Çünkü aklımda başka bir soru vardı.Django,Play veya Rails hangisinde yapacağım değil de bu yaptığım uygulamayı nerede barındıracağımı düşündüm.Heroku,Dotcloud ile Google Apps en büyük alternatiflerimdi.Ancak onlarında ücretsiz olması bende kota sınırlamasını düşündürdü.Bu yüzden kendi serverımı almaktan başka çarem kalmadı.Ama bu da bir üniversite öğrencisine tuzlu geleceğinden bundan da vazgeçtim.", "\r\n\tHepsinden geçip geriye bana gene PHP kalmıştı.Kendisi ilk göz ağrım olması gereğiyle hayatımdan hiçbir zaman çıkmayacak.Ancak eski heyecanı vermiyor bana artık.Ne bileyim sanki adamı artık sıkıyor.Bunların yanında şu aralar herkesinde kendi blogunu kodlaması da beni PHP den soğutan etmenler arasında.Bu yüzden yeni ufuklara yelken açmak bana daha cezbedici geliyor.", "\r\n\tBu yüzden yaz tatiline kadar beklemeye karar verdim.Yaz geldiğinde yurt interneti gibi bir intihar sebebimde kalmıyacağı için kendimi Linux ve Programlama dünyasına bırakacağım.O zaman Play! de yeni sürümünü çıkarmış olacak.Bende o meçhul kararımı ilerleyen zamanlarda vermiş olurum.Ama her ne olursa olsun hala favorim olarak Django duruyor.İnşallah Hblog v3 Django ile çıkar.Ama ne ile kodlayacağım hiç belli olmaz.Bakarsınız Rails kodlamışım.Hayırlısı."], "description": [" Son Dönemlerde Yaşadığım Kararsızlıklar"], "title": ["Blogsuzluk Ve Kararsızlık"]}
{"date": ["03 Haziran 2012 "], "post": [" Youtubedaki Arşivlik Eğitim Videoları", "\r\n\tYoutube'un önemi gün geçtikçe daha da artmaya başladı.Bunun sebebi ise artık tek bir amaca yönelmiş bir video sitesi olmaktan çıkması.Yani artık sitede sadece film,dizi videoları değilde programlama,bilgisayar bilimleri,matematik,fizik,kimya gibi akademik konulardan oluşan videolarda yer alıyor.Ben bugün sizlere hem ortaokul,lise hem de üniversiteye uygun konulardan oluşan bir youtube playlist arşivi paylaşacağım.Genel olarak daha fazla mühendislere hitap etsede birçok lise öğrencisinin de işine yarayacağına inanıyorum.Videoların ingilizce olduğunu da unutmayınız.", "\r\n\t", ", Salman Khan, Khan Academy", ", DerekOwens", ", Salman Khan, Khan Academy", ", N J Wildberger, The University of New South Wales", ", Donylee", ", Donylee", ", Donylee", ", Donylee", ", R.K.Mittal, IIT Delhi", ", Salman Khan, Khan Academy", ", Salman Khan, Khan Academy", ", Salman Khan, Khan Academy", ", Salman Khan, Khan Academy", ", Salman Khan, Khan Academy", ", Jim Spencer, Syracuse University", ", James Nowick, University of California", ", January 2004, Sarah Tabacco, MIT", ", V.Balakrishnan, IIT Madras", ", Richard Delaware, University of Missouri Kansas City", ", Gilbert Strang, MIT", ", William Durham, Stanford", ", MIT", ", Salman Khan, Khan Academy", ", Fall 2005, MIT", ", Mangala Sunder, IIT Madras", ", Chris Tisdell, The University of New South Wales", ", V. Ravishankar, IIT Kanpur", ", Spring 2003, Edmund Bertschinger, MIT", ", Fall 2008, J. Michael McBride, Yale", ", Russell Geanangel, University of Houston", ", Fall 2006, Ramamurti Shankar, Yale", ", Salman Khan, Khan Academy", ", Channing Robertson, Stanford", ", Fall 2004, MIT", ", Spring 2004, Robert Field, MIT", ", Spring 2005, Gilbert Strang, MIT", ", The University of New South Wales", ", Salman Khan, Khan Academy", ", Herbert Enderton, UCLA", ", Gilbert Strang, MIT", ", Swagato K. Ray, IIT Kanpur", ", P.N. Agrawal, IIT Roorkee", ", Donylee", ", Donylee", ", Stanford", ", Leonard Susskind, Stanford", ", Stanford", ", Stanford", ", Stanford", ", Stanford", ", Virtual University", ", Fall 2007, Denis Auroux, MIT", ", Salman Khan, Khan Academy", ", Hardinger, UCLA", ", Leonard Susskind, Stanford", ", Leonard Susskind, Stanford", ", Salman Khan, Khan Academy", ", Robert Riggs, University of Missouri Kansas City", ", Robert Riggs, University of Missouri Kansas City", ", Spring 2010, Robert Riggs, University of Missouri Kansas City", ", Jerzy Wrobel, University of Missouri Kansas City", ", Jerzy Wrobel, University of Missouri Kansas City", ", Walter Lewin, MIT", ", S. Bharadwaj, IIT Kharagpur", ", MIT", ", Salman Khan, Khan Academy", ", MIT", ", Fall 2008, Catherine Drennan, MIT", ", Salman Khan, Khan Academy", ", V.Balakrishnan, IIT Madras", ", Salman Khan, Khan Academy", ", Fall 2006, David Jerison, MIT", ", Fall 2008, Robert Field, MIT", ", Salman Khan, Khan Academy", ", Brad Osgood, Stanford", ", Spring 2008, Moungi Bawendi, MIT", ", Salman Khan, Khan Academy", ", Chris Tisdell, The University of New South Wales", ", Anupam Basu, IIT Kharagpur", ", P.Dasgupta, IIT Kharagpur", ", Oussama Khatib, Stanford", ", Richard Buckland, The University of New South Wales", ", Richard Buckland, The University of New South Wales", ", Anshul Kumar, IIT Delhi", ", Sukhendu Das, IIT Madras", ", Fall 2005, MIT", ", S. Raman, IIT Madras", ", Mehran Sahami, Stanford", ", Julie Zelenski, Stanford", ", Jerry Cain, Stanford", ", Spring 2009, Hari Balakrishnan, MIT", ", 2008, Matthew Papakipos, Stanford", ", Spring 2008, Surendar Chandra", ", Spring 2009, Surendar Chandra", ", Fall 2008, Surendar Chandra", ", Fall 2006, Jonathan Shewchuk, UC Berkeley", ", Naveen Garg, IIT Delhi", ", D. Janaki Ram, IIT Madras", ", Abhiram G Ranade, IIT Bombay", ", Winter 2010, Ben Galbraith, Stanford", ", P.K. Biswas, IIT Kharagpur", ", D. Roychoudhury, IIT Kharagpur", ", Kamala Krithivasan, IIT Madras", ", Kamala Krithivasan, IIT Madras", ", Stanford", ", Indranil Sengupta, IIT Kharagpur", ", Fall 2005, Erik Demaine, MIT", ", Prem Kalra, IIT Delhi", ", Fall 2008, Eric Grimson, MIT", ", Fall 2009, David J. Malan, Harvard", ", MIT", ", Deepak Gupta, IIT Kanpur", ", Winter 2010, Alan Cannistraro, Stanford", ", Andrew Ng, Stanford", ", Dean Utian, The University of New South Wales", ", P. B. Sunil Kumar, IIT Madras", ", P.B.Sunil Kumar, IIT Madras", ", Rushikesh K Joshi, IIT Bombay", ", Harold Abelson, MIT", ", V Rajaraman, IISc Bangalore", ", Dean Utian, The University of New South Wales", ", K. Radhakrishna Rao, IIT Madras", ", L.Umanand, IISc Bangalore", ", Chitralekha Mahanta, IIT Guwahati", ", T.S. Natarajan, IIT Madras", ", S.Banerjee, IIT Kharagpur", ", S.C.Dutta Roy, IIT Delhi", ", Anant Agarwal, MIT", ", S.D.Agashe, IIT Bombay", ", Stephen Boyd, Stanford", ", Stephen Boyd, Stanford", ", S. Srinivasan, IIT Madras", ", Amitava Dasgupta, IIT Madras", ", T.K.Basu, IIT Kharagpur", ", Sabyasachi Sengupta, IIT Kharagpur", ", Soumitro Banerjee, IIT Kharagpur", ", Ambikairajah, The University of New South Wales", ", Walter Lewin, MIT", ", Harishankar Ramachandran, IIT Madras", ", I.Sengupta, IIT Kharagpur", ", K.Radhakrishna Rao, IIT Madras", ", K.Radhakrishna Rao, IIT Madras", ", Santanu Chaudhary, IIT Delhi", ", S.Banerjee, IIT Kharagpur", ", Stanford", ", K.N.Bhat, IIT Madras", ", N.K.Kishore, IIT Kharagpur", ", S. Mukhopadhyay, IIT Kharagpur", ", K.Gopakumar, IISc Bangalore", ", Alok Barua, IIT Kharagpur", ", Laxmidhar Behera, IIT Kanpur", ", R. Krishnakumar, IIT Madras", ", Stephen Boyd, Stanford", ", Santiram Kal, IIT Kharagpur", ", T.K.Basu, IIT Kharagpur", ", S.Sengupta, IIT Kharagpur", ", B.G. Fernandes, IIT Bombay", ", M.L.Kothari, IIT Delhi", ", D.P.Kothari, IIT Delhi", ", A.K. Sinha, IIT Kharagpur", ", S.N.Singh, IIT Kanpur", ", Mrityunjoy Chakraborty, IIT Kharagpur", ", S. Karmalkar, IIT Madras", ", R.K. Shevgaonkar, IIT Bombay", ", S.Srinivasan, IIT Madras", ", Dr. Nandita Dasgupta, IIT Madras", ", Mrityunjoy Chakraborty, IIT Kharagpur", ", Abhay Karandikar, IIT Bombay", ", Surendra Prasad, IIT Delhi", ", Sujoy Ghosh, IIT Kharagpur", ", Ajit Pal, IIT Kharagpur", ", Bikash Kumar Dey, IIT Bombay", ", P.K. Biswas, IIT Kharagpur", ", S.C. Dutta Roy, IIT Delhi", ", E. Ambikairajah, The University of New South Wales", ", S. Mukhopadhyay, IIT Kharagpur", ", V.G.K.Murti, IIT Madras", ", David Forney, MIT", ", Fall 2006, Robert Gallager and Prof. Lizhong Zheng, MIT", ", Ranjan Bose, IIT Delhi", ", Salman Khan, Khan Academy", ", Patrick Dixon", ", K.B. Akhilesh, IISc Bangalore", ", Patrick Dixon", ", Patrick Dixon", ", Salman Khan, Khan Academy", ", Patrick Dixon", ", Patrick Dixon", ", Patrick Dixon", ", Patrick Dixon", ", Patrick Dixon", ", Patrick Dixon", ", Patrick Dixon", ", Patrick Dixon", ", Kalyan Chakravarti, IIT Kharagpur", ", Harvard", ", Fall 2008, Earll Murman, MIT", ", Patrick Dixon", ", Biswajit Mahanty, IIT Kharagpur", ", Anuradha Sharma, IIT Delhi", ", Patrick Dixon", ", Spring 2005, Sanjay Sarma, MIT", ", Harvard", ", Patrick Dixon", ", Patrick Dixon", ", Patrick Dixon", ", Salman Khan, Khan Academy", ", London School of Business and Finance", ", London School of Business and Finance", ", London School of Business and Finance", ", London School of Business and Finance", ", Salman Khan, Khan Academy", ", Winter 2009, John Fountain, University of Canterbury", ", Winter 2009, John Fountain, University of Canterbury", ", Salman Khan, Khan Academy", ", Spring 2008, Robert Shiller, Yale", ", Fall 2007, Ben Polak, Yale", ", Fall 2008, Mark Thoma, University of Oregon", ", Winter 2009, Mark Thoma, University of Oregon", ", Winter 2009, John Fountain, University of Canterbury", ", Winter 2009, John Fountain, University of Canterbury", ", Brue", ", R.Krishnakumar, IIT Madras", ", G.Srinivasan, IIT Madras", ", S.K. Maiti, IIT Bombay", ", P.K.Das, IIT Kharagpur", ", Spring 2005, Gerbrand Ceder, MIT", ", S.K. Som, IIT Kharagpur", ", Anoop Chawla, IIT Delhi", ", David Hardt, MIT", ", G. Chakraborty, IIT Kharagpur", ", Amitabha Ghosh, IIT Kanpur", ", Manoj K Harbola, IIT Kanpur", ", G.Saravana Kumar, IIT Guwahati", ", C.S. Upadhyay, IIT Kanpur", ", Donylee", ", G. Srinivasan, IIT Madras", ", U.N. Gaitonde, IIT Bombay", ", Pradeep Kumar, IIT Roorkee", ", Ashok K Mallik, IIT Kanpur", ", D.K. Dwivedi, IIT Roorkee", ", A.K. Chattopadhyay, IIT Kharagpur", ", S.K. Gupta, IIT Delhi", ", SK.Gupta, IIT Delhi", ", S. P. Venkateshan, IIT Madras", ", S.K.Dwivedy, IIT Guwahati", ", R. Raman, IIT Madras", ", Arun Kanda, IIT Delhi", ", Donylee", ", Donylee", ", R.C. Arora, IIT Kharagpur", ", C. Amarnath, IIT Bombay", ", S.P.Harsha, IIT Roorkee", ", Bernhardt Wuensch, MIT", ", Fall 2002, Jan Wampler, MIT", ", B. Bhattacharjee, IIT Delhi", ", N. Dhang, IIT Kharagpur", ", Damodar Maity, IIT Guwahati", ", Debasis Roy, IIT Kharagpur", ", Mukesh Sharma, IIT Kanpur", ", T.I.Eldho, IIT Bombay", ", N.K.Samadhiya, IIT Roorkee", ", Arup Kumar Sarma, IIT Guwahati", ", Bhargab Maitra, IIT Kharagpur", ", M.S.Siva Kumar, IIT Madras", ", Krzysztof Wodiczko, MIT", ", Mark Jarzombek, MIT", ", S.K.Ghosh, IIT Roorkee", ", S. C. Misra, IIT Kharagpur", ", A.K.Sengupta, IIT Madras", ", B.V.S. Viswanadham, IIT Bombay", ", S.K.Bhattacharyya, IIT Kharagpur", ", P. Banerjee, IIT Bombay", ", Bharat Lohani, IIT Kanpur", ", Rajat Rastogi, IIT Roorkee", ", B. S. Murty, IIT Madras", ", Rajesh Srivastava, IIT Kanpur", ", Lynn Rehm, University of Houston", ", Winter 2009, William Grisham, UCLA", ", Herb Agan, University of Houston", ", David (Dov) Liberman, University of Houston", ", David (Dov) Liberman, University of Houston", ", Lynda Villanueva, University of Houston", ", Edward Sheridan, University of Houston", ", Richard A. Kasschau, University of Houston", ", David Phillips, University of Houston", ", Fall 2006, Steven B. Smith, Yale", ", Paul Bloom, Yale", ", Richard A. Kasschau, University of Houston", ", Michael Sandel, Harvard", ", Spring 2004, Irving Singer, MIT", ", Fall 2004, Irving Singer, MIT", ", Fall 2004, Irving Singer, MIT", ", Richard Kasschau, University of Houston", ", Benjamin Karney, UCLA", ", Herb Agan, University of Houston", ", Edward Sheridan, University of Houston", ", Spring 2007, Shelly Kagan, Yale", ", Marian C. DIAMOND, UC Berkeley", ", Fall 2005, Jeffrey Hoffman, MIT", ", Winter 2006, Lynn Rothschild, Stanford", ", Winter 2010, Stanford", ", Spring 2007, Charles Bailyn, Yale", ", Mark Drela, MIT", ", Salman Khan, Khan Academy", ", Spring 2008, W. Mark Saltzman, Yale", ", Spring 2009, Robert Wyman, Yale", ", University of Michigan", ", Winter 2009, Stanford", ", Spring 2006, MIT", ", Fall 2004, Eric Lander, MIT", ", Spring 2005, Penny Chisholm, MIT", ", Spring 2009, Stephen C. Stearns, Yale", ", Fall 2009, Stanford", ", Tyrone Tillery, University of Houston", ", Clayborne Carson, Stanford", ", Thomas O’Brien, University of Houston", ", Carrie Menkel-Meadow, MIT", ", Fall 2008, John Merriman, Yale", ", Fall 2007, John Merriman, Yale", ", Lynn Hunt, UCLA", ", Spring 2009, Courtenay Raia, UCLA", ", Fall 2007, Donald Kagan, Yale", ", Thomas O’Brien, University of Houston", ", Spring 2009, Diana E. E. Kleiner, Yale", ", Sally Vaughn, University of Houston", ", Sally Vaughn, University of Houston", ", Robert Buzzanco, University of Houston", ", Sally Vaughn, University of Houston", ", Robert Buzzanco, University of Houston", ", Thomas O Brien, University of Houston", ", Sally Vaughn, University of Houston", ", Thomas O’Brien, University of Houston", ", Winter 2007, Mark Sawyer, UCLA", ", Winter 2009, Edwin Schauble, UCLA", ", Salman Khan, Khan Academy", ", Lynn Mitchell, University of Houston", ", Martha Haun, University of Houston", ", Fall 2008, Scott Sherman, UCLA", ", Gay Goodman, University of Houston", ", Martha Haun, University of Houston", ", Deborah Bridges, University of Houston", ", Jayanta Bhattacharya, IIT Kharagpur", ", Salman Khan, Khan Academy", ", Winter 2009, Bob Goldberg, UCLA", ", Salman Khan, Khan Academy", ", Salman Khan, Khan Academy", ", Martha J. Haun, University of Houston", ", Winter 2010, Jim Newton, UCLA", ", Susan Kellogg, University of Houston", ", Winter 2009, Jay Phelan, UCLA", ", Salman Khan, Khan Academy", ", Anne Whiston Spirn, MIT", ", Shigeru Miyagawa, MIT", ", Virtual University", ", Salman Khan, Khan Academy", ", Winter 2008, Kathleen Bawn, UCLA", ", Salman Khan, Khan Academy", ", A.H. Sheikh, IIT Kharagpur", ", Fall 2009, Glen MacDonald, UCLA", ", Sanjoy Mahajan, MIT", ", MIT", ", Cesar Seveso, University of Houston", ", Lynn Mitchell, University of Houston", ", David Blight, Yale", ", Norris G. Lang, University of Houston", ", Salman Khan, Khan Academy"], "description": [" Youtubedaki Arşivlik Eğitim Videoları"], "title": ["Youtube Eğitim Videoları"]}
{"date": ["20 Temmuz 2012 "], "post": [" 11 Ayın Sultanına 50 Derecede Merhaba", "\r\n\tŞöyle bir arkama baktığımda yazı girmeyeli baya uzun bir zaman olmuş.Django ve Python'a ara verip kendimi Arduino'ya kaptırdıktan sonra diğer konuları hep aksatmışım.Zamanında hep güncel konulardan da paylaşımlar yapardım.İşte bu geleneği bozmamak için bugün ilk orucunu tuttuğumuz Ramazan'a hoş geldin demek istedim.İnşallah herkesi bu yaz sıcaklarında oruç zorlamaz.Benim gibi Manavgat'ta olanların da karşılaştığı susama sorununundan en az derece etkilenirsiniz.Aşağıda 2012 yılı için Manavgat resmi imsakiyesini bulabilirsiniz.Bunu hiçbir şekilde üzerinde değişiklik yapmadan müftülüğün sitesinden aldım.Herkese hayırlı ramazanlar.", "\r\n\t", "\r\n\t"], "description": [" 11 Ayın Sultanına 50 Derecede Merhaba"], "title": ["Manavgat İmsakiyesi"]}
{"date": ["22 Temmuz 2012 "], "post": [" 1 Yılı Geride Bırakan Kişisel Blogum", "\r\n\tRamazan ayının gelmesi ve sıcakların iyice bastırmasıyla sitemde arduino,programlama,python,django gibi teknik konulara bir süre ara verdim.Bu aralarda çok fazla paylaşım yapmayı düşünmüyorum.Sadece çok önemli olaylar ve gerekli olduğunu düşündüğüm paylaşımlar yapacağım.Bunların belki de en önemlisi kişisel blogum'un 2 yaşına girmesi oldu.Bundan tam 1 yıl önce hblogv1 php sürümüyle blog yazmaya başlamıştım.Bu geçen bir yıl içinde toplam 3 sürüm değiştirerek bu günlere geldim.Bu sürümlerden  ilk ikisini php,şu andaki sistemide python kullanarak yazdım.Bu konular hakkında daha detaylı bilgi için hdblog sürümüne geçtiğimi anlattığım ilk yazıma bakabilirsiniz.", "\r\n\tBu kadar konuştuktan sonra blogumun 2.yaşını kutluyorum ve nice 2 yaşlara diyorum.Çok yakında daha fazla paylaşımı blogumda bulacağınızı unutmayın.Sadece yaz tatilinin geçmesini bekleyin.", "\r\n\t"], "description": [" 1 Yılı Geride Bırakan Kişisel Blogum"], "title": ["Blogum 2 Yaşında"]}
{"date": ["04 Ağustos 2012 "], "post": [" Temmuz Ayı İçin Programlama Dilleri Sıralaması", "\r\n\tPython,Ruby,Perl,C,C++ gibi büyük dillerin belirli tanımlamalara göre sıralanıp her ay Tiobe tarafından yayımlanıyor.Temmuz ayı için olansa son günlerde yayınlandı.Bu sıralamaya en son baktığımda Java'nın ilk sırada olduğunu hatırlıyordum.Ancak Temmuz ayı sıralamasında yerini C'ye kaptırmış.Belki bu daha önce olmuş olabilir ama ben yeni farkettim.Beni bu sıralamada en çok üzen ise her baktığımda Python'u 7-8-9 sıralamalarından birisinde görmek.Temmuz ayında da 8.sırada.İlk 3 kesinlikle C,C++ veya Javadan oluşmasına karşı değilim ancak Python'u 8.sırada görmek beni üzüyor.Gerçek hakkının en azından 4.sıra olması gerektiğini düşünüyorum.Ama bunun böyle olması için biraz daha beklememiz gerekiyor galiba.", "\r\n\t"], "description": [" Temmuz Ayı İçin Programlama Dilleri Sıralaması"], "title": ["Tiobe Temmuz Ayı Sıralaması"]}
